var upload_Passport = '';
var upload_QID = '';
var upload_Certificates = '';
var upload_workletter_MinistryDevelopment = '';
var upload_person = '';
var upload_married = '';
var upload_Health = '';
var upload_Transcript = '';
var upload_other = '';

var current_fs, next_fs, previous_fs; //fieldsets
var opacity;
var current = 1;


var data_county = [
    { 'id': '1', 'Name': 'قطر', 'NameAr': 'قطر' },
    { 'id': '42', 'Name': 'الاورغواي', 'NameAr': 'الاورغواي' },
    { 'id': '43', 'Name': 'الأرجنتين', 'NameAr': 'الأرجنتين' },
    { 'id': '44', 'Name': 'أثيوبيا', 'NameAr': 'أثيوبيا' },
    { 'id': '45', 'Name': 'الأردن', 'NameAr': 'الأردن' },
    { 'id': '46', 'Name': 'أرمينيا', 'NameAr': 'أرمينيا' },
    { 'id': '47', 'Name': 'أرتيريا', 'NameAr': 'أرتيريا' },
    { 'id': '48', 'Name': 'أذربيجان', 'NameAr': 'أذربيجان' },
    { 'id': '49', 'Name': 'أسبانيا', 'NameAr': 'أسبانيا' },
    { 'id': '50', 'Name': 'أستراليا', 'NameAr': 'أستراليا' },
    { 'id': '51', 'Name': 'أوستوانيا', 'NameAr': 'أوستوانيا' },
    { 'id': '52', 'Name': 'فلسطين', 'NameAr': 'فلسطين' },
    { 'id': '53', 'Name': 'أفريقياالجنوبيه', 'NameAr': 'أفريقياالجنوبيه' },
    { 'id': '54', 'Name': 'أفريقياالوسطى', 'NameAr': 'أفريقياالوسطى' },
    { 'id': '55', 'Name': 'أفغانستان', 'NameAr': 'أفغانستان' },
    { 'id': '56', 'Name': 'البانيا', 'NameAr': 'البانيا' },
    { 'id': '57', 'Name': 'أوكرانيا', 'NameAr': 'أوكرانيا' },
    { 'id': '58', 'Name': 'الأكوادور', 'NameAr': 'الأكوادور' },
    { 'id': '59', 'Name': 'الإماراتالعربيه', 'NameAr': 'الإماراتالعربيه' },
    { 'id': '60', 'Name': 'المانيا', 'NameAr': 'المانيا' },
    { 'id': '61', 'Name': 'أندونيسيا', 'NameAr': 'أندونيسيا' },
    { 'id': '62', 'Name': 'أنغولا', 'NameAr': 'أنغولا' },
    { 'id': '63', 'Name': 'أوزباكستان', 'NameAr': 'أوزباكستان' },
    { 'id': '64', 'Name': 'أوغندا', 'NameAr': 'أوغندا' },
    { 'id': '65', 'Name': 'إيران', 'NameAr': 'إيران' },
    { 'id': '66', 'Name': 'إيرلندا', 'NameAr': 'إيرلندا' },
    { 'id': '67', 'Name': 'ايسلندا', 'NameAr': 'ايسلندا' },
    { 'id': '68', 'Name': 'إيطاليا', 'NameAr': 'إيطاليا' },
    { 'id': '69', 'Name': 'باكستان', 'NameAr': 'باكستان' },
    { 'id': '70', 'Name': 'بنما', 'NameAr': 'بنما' },
    { 'id': '71', 'Name': 'البحرين', 'NameAr': 'البحرين' },
    { 'id': '72', 'Name': 'البرازيل', 'NameAr': 'البرازيل' },
    { 'id': '73', 'Name': 'البرتغال', 'NameAr': 'البرتغال' },
    { 'id': '74', 'Name': 'بروناي', 'NameAr': 'بروناي' },
    { 'id': '75', 'Name': 'بلجيكا', 'NameAr': 'بلجيكا' },
    { 'id': '76', 'Name': 'بلغاريا', 'NameAr': 'بلغاريا' },
    { 'id': '77', 'Name': 'بنغلاديش', 'NameAr': 'بنغلاديش' },
    { 'id': '78', 'Name': 'بنين', 'NameAr': 'بنين' },
    { 'id': '79', 'Name': 'بهوتان', 'NameAr': 'بهوتان' },
    { 'id': '80', 'Name': 'بوتسوانا', 'NameAr': 'بوتسوانا' },
    { 'id': '81', 'Name': 'بوركينافاسو', 'NameAr': 'بوركينافاسو' },
    { 'id': '82', 'Name': 'بوروندي', 'NameAr': 'بوروندي' },
    { 'id': '83', 'Name': 'البوسنهوالهرسك', 'NameAr': 'البوسنهوالهرسك' },
    { 'id': '84', 'Name': 'بولونيا', 'NameAr': 'بولونيا' },
    { 'id': '85', 'Name': 'بوليفيا', 'NameAr': 'بوليفيا' },
    { 'id': '86', 'Name': 'بيلاروسيا', 'NameAr': 'بيلاروسيا' },
    { 'id': '87', 'Name': 'بيرو', 'NameAr': 'بيرو' },
    { 'id': '88', 'Name': 'تنزانيا', 'NameAr': 'تنزانيا' },
    { 'id': '89', 'Name': 'تايلاند', 'NameAr': 'تايلاند' },
    { 'id': '90', 'Name': 'تايوان', 'NameAr': 'تايوان' },
    { 'id': '91', 'Name': 'تركمانستان', 'NameAr': 'تركمانستان' },
    { 'id': '92', 'Name': 'تركيا', 'NameAr': 'تركيا' },
    { 'id': '93', 'Name': 'تشاد', 'NameAr': 'تشاد' },
    { 'id': '94', 'Name': 'التشيك', 'NameAr': 'التشيك' },
    { 'id': '95', 'Name': 'تشيلي', 'NameAr': 'تشيلي' },
    { 'id': '96', 'Name': 'توغو', 'NameAr': 'توغو' },
    { 'id': '97', 'Name': 'تونس', 'NameAr': 'تونس' },
    { 'id': '98', 'Name': 'جامايكا', 'NameAr': 'جامايكا' },
    { 'id': '99', 'Name': 'ايسلندا', 'NameAr': 'ايسلندا' },
    { 'id': '100', 'Name': 'إيطاليا', 'NameAr': 'إيطاليا' },
    { 'id': '101', 'Name': 'الجزائر', 'NameAr': 'الجزائر' },
    { 'id': '102', 'Name': 'جورجيا', 'NameAr': 'جورجيا' },
    { 'id': '103', 'Name': 'الدانمارك', 'NameAr': 'الدانمارك' },
    { 'id': '104', 'Name': 'الدومنيكان', 'NameAr': 'الدومنيكان' },
    { 'id': '105', 'Name': 'راوندا', 'NameAr': 'راوندا' },
    { 'id': '106', 'Name': 'روسيا', 'NameAr': 'روسيا' },
    { 'id': '107', 'Name': 'رومانيا', 'NameAr': 'رومانيا' },
    { 'id': '108', 'Name': 'زائير', 'NameAr': 'زائير' },
    { 'id': '109', 'Name': 'زامبيا', 'NameAr': 'زامبيا' },
    { 'id': '110', 'Name': 'زيمبابوي', 'NameAr': 'زيمبابوي' },
    { 'id': '111', 'Name': 'ساحلالعاج', 'NameAr': 'ساحلالعاج' },
    { 'id': '112', 'Name': 'سريلانكا', 'NameAr': 'سريلانكا' },
    { 'id': '113', 'Name': 'السعودية', 'NameAr': 'السعودية' },
    { 'id': '114', 'Name': 'السلفادور', 'NameAr': 'السلفادور' },
    { 'id': '115', 'Name': 'سلوفاكيا', 'NameAr': 'سلوفاكيا' },
    { 'id': '116', 'Name': 'سلوفينيا', 'NameAr': 'سلوفينيا' },
    { 'id': '117', 'Name': 'السودان', 'NameAr': 'السودان' },
    { 'id': '118', 'Name': 'سوريا', 'NameAr': 'سوريا' },
    { 'id': '119', 'Name': 'السويد', 'NameAr': 'السويد' },
    { 'id': '120', 'Name': 'سويسرا', 'NameAr': 'سويسرا' },
    { 'id': '121', 'Name': 'سنغافور', 'NameAr': 'سنغافور' },
    { 'id': '122', 'Name': 'السنغال', 'NameAr': 'السنغال' },
    { 'id': '123', 'Name': 'الصومال', 'NameAr': 'الصومال' },
    { 'id': '124', 'Name': 'الصين', 'NameAr': 'الصين' },
    { 'id': '125', 'Name': 'العراق', 'NameAr': 'العراق' },
    { 'id': '126', 'Name': 'عمان', 'NameAr': 'عمان' },
    { 'id': '127', 'Name': 'الغابون', 'NameAr': 'الغابون' },
    { 'id': '128', 'Name': 'غامبيا', 'NameAr': 'غامبيا' },
    { 'id': '129', 'Name': 'غانا', 'NameAr': 'غانا' },
    { 'id': '130', 'Name': 'غينيا', 'NameAr': 'غينيا' },
    { 'id': '131', 'Name': 'غينياالإستوائيه', 'NameAr': 'غينياالإستوائيه' },
    { 'id': '132', 'Name': 'فرنسا', 'NameAr': 'فرنسا' },
    { 'id': '133', 'Name': 'غينيابيساو', 'NameAr': 'غينيابيساو' },
    { 'id': '134', 'Name': 'فنزويلا', 'NameAr': 'فنزويلا' },
    { 'id': '135', 'Name': 'فنلندا', 'NameAr': 'فنلندا' },
    { 'id': '136', 'Name': 'فيتنام', 'NameAr': 'فيتنام' },
    { 'id': '137', 'Name': 'قبرص', 'NameAr': 'قبرص' },
    { 'id': '138', 'Name': 'الفلبين', 'NameAr': 'الفلبين' },
    { 'id': '140', 'Name': 'كرواتيا', 'NameAr': 'كرواتيا' },
    { 'id': '141', 'Name': 'الكاميرون', 'NameAr': 'الكاميرون' },
    { 'id': '142', 'Name': 'كمبوديا', 'NameAr': 'كمبوديا' },
    { 'id': '143', 'Name': 'كندا', 'NameAr': 'كندا' },
    { 'id': '144', 'Name': 'كوبا', 'NameAr': 'كوبا' },
    { 'id': '145', 'Name': 'كورياالجنوبيه', 'NameAr': 'كورياالجنوبيه' },
    { 'id': '146', 'Name': 'كورياالشماليه', 'NameAr': 'كورياالشماليه' },
    { 'id': '147', 'Name': 'كوستاريك', 'NameAr': 'كوستاريك' },
    { 'id': '148', 'Name': 'كولومبيا', 'NameAr': 'كولومبيا' },
    { 'id': '149', 'Name': 'الكونغو', 'NameAr': 'الكونغو' },
    { 'id': '150', 'Name': 'الكويت', 'NameAr': 'الكويت' },
    { 'id': '151', 'Name': 'كينيا', 'NameAr': 'كينيا' },
    { 'id': '152', 'Name': 'لبنان', 'NameAr': 'لبنان' },
    { 'id': '153', 'Name': 'ليبيريا', 'NameAr': 'ليبيريا' },
    { 'id': '154', 'Name': 'مالي', 'NameAr': 'مالي' },
    { 'id': '155', 'Name': 'ماليزيا', 'NameAr': 'ماليزيا' },
    { 'id': '156', 'Name': 'المغرب', 'NameAr': 'المغرب' },
    { 'id': '157', 'Name': 'مقدونيا', 'NameAr': 'مقدونيا' },
    { 'id': '158', 'Name': 'المكسيك', 'NameAr': 'المكسيك' },
    { 'id': '159', 'Name': 'بريطانيا', 'NameAr': 'بريطانيا' },
    { 'id': '160', 'Name': 'موريتانيا', 'NameAr': 'موريتانيا' },
    { 'id': '161', 'Name': 'موزمبيق', 'NameAr': 'موزمبيق' },
    { 'id': '162', 'Name': 'النرويج', 'NameAr': 'النرويج' },
    { 'id': '163', 'Name': 'النمسا', 'NameAr': 'النمسا' },
    { 'id': '164', 'Name': 'النيبال', 'NameAr': 'النيبال' },
    { 'id': '165', 'Name': 'النيجر', 'NameAr': 'النيجر' },
    { 'id': '166', 'Name': 'نيجيريا', 'NameAr': 'نيجيريا' },
    { 'id': '167', 'Name': 'نيكاراغوا', 'NameAr': 'نيكاراغوا' },
    { 'id': '168', 'Name': 'نيوزيلاند', 'NameAr': 'نيوزيلاند' },
    { 'id': '169', 'Name': 'الهند', 'NameAr': 'الهند' },
    { 'id': '170', 'Name': 'هنغاريا', 'NameAr': 'هنغاريا' },
    { 'id': '171', 'Name': 'هولندا', 'NameAr': 'هولندا' },
    { 'id': '172', 'Name': 'هونغكونغ', 'NameAr': 'هونغكونغ' },
    { 'id': '173', 'Name': 'أمريكا', 'NameAr': 'أمريكا' },
    { 'id': '174', 'Name': 'اليابان', 'NameAr': 'اليابان' },
    { 'id': '175', 'Name': 'مصر', 'NameAr': 'مصر' },
    { 'id': '176', 'Name': 'اليمن', 'NameAr': 'اليمن' }


]

var data_UniversitySpecialization = [
    { 'id': '2', 'Name': "الاتصالات والدراسات الإعلامية", 'NameAr': "الاتصالات والدراسات الإعلامية" },
    { 'id': '3', 'Name': "الاقتصاد", 'NameAr': "الاقتصاد" },
    { 'id': '4', 'Name': "الاقتصاد الدولي", 'NameAr': "الاقتصاد الدولي" },
    { 'id': '5', 'Name': "الإحصاء", 'NameAr': "الإحصاء" },
    { 'id': '6', 'Name': "الإدارة", 'NameAr': "الإدارة" },
    { 'id': '7', 'Name': "الإعلام", 'NameAr': "الإعلام" },
    { 'id': '8', 'Name': "الإعلام والصحافة", 'NameAr': "الإعلام والصحافة" },
    { 'id': '9', 'Name': "الأدب الإنجليزي واللسانيات", 'NameAr': "الأدب الإنجليزي واللسانيات" },
    { 'id': '10', 'Name': "الأرصاد الجوية", 'NameAr': "الأرصاد الجوية" },
    { 'id': '11', 'Name': "الأعمال / التجارة العامة", 'NameAr': "الأعمال / التجارة العامة" },
    { 'id': '12', 'Name': "الأعمال والدراسات الإدارية", 'NameAr': "الأعمال والدراسات الإدارية" },
    { 'id': '13', 'Name': "الأعمال وإدارة الموارد البشرية", 'NameAr': "الأعمال وإدارة الموارد البشرية" },
    { 'id': '14', 'Name': "الآداب والعلوم، الدراسات العامة والعلوم الإنسانية", 'NameAr': "الآداب والعلوم، الدراسات العامة والعلوم الإنسانية" },
    { 'id': '15', 'Name': "التاريخ", 'NameAr': "التاريخ" },
    { 'id': '16', 'Name': "التاريخ الدولي", 'NameAr': "التاريخ الدولي" },
    { 'id': '17', 'Name': "التسويق", 'NameAr': "التسويق" },
    { 'id': '18', 'Name': "التصميم الداخلي", 'NameAr': "التصميم الداخلي" },
    { 'id': '19', 'Name': "التمويل والخدمات المصرفية الاستثمارية", 'NameAr': "التمويل والخدمات المصرفية الاستثمارية" },
    { 'id': '20', 'Name': "التواصل الإعلامي", 'NameAr': "التواصل الإعلامي" },
    { 'id': '21', 'Name': "الحيوية الطبية / الهندسة الطبية", 'NameAr': "الحيوية الطبية / الهندسة الطبية" },
    { 'id': '22', 'Name': "الخدمة الاجتماعية", 'NameAr': "الخدمة الاجتماعية" },
    { 'id': '23', 'Name': "الدراسات الإسلامية", 'NameAr': "الدراسات الإسلامية" },
    { 'id': '24', 'Name': "الدراسات العامة", 'NameAr': "الدراسات العامة" },
    { 'id': '25', 'Name': "الدعوة والإعلام", 'NameAr': "الدعوة والإعلام" },
    { 'id': '26', 'Name': "الدكتوراه في الهندسة", 'NameAr': "الدكتوراه في الهندسة" },
    { 'id': '27', 'Name': "الرسم والطباعة", 'NameAr': "الرسم والطباعة" },
    { 'id': '28', 'Name': "السياسات والتخطيط والتنمية", 'NameAr': "السياسات والتخطيط والتنمية" },
    { 'id': '29', 'Name': "السياسة", 'NameAr': "السياسة" },
    { 'id': '30', 'Name': "السياسة الدولية", 'NameAr': "السياسة الدولية" },
    { 'id': '31', 'Name': "السياسة والثقافة", 'NameAr': "السياسة والثقافة" },
    { 'id': '32', 'Name': "السياسة والعلاقات الدولية", 'NameAr': "السياسة والعلاقات الدولية" },
    { 'id': '33', 'Name': "السياسة والقوانين", 'NameAr': "السياسة والقوانين" },
    { 'id': '34', 'Name': "الشؤون الدولية", 'NameAr': "الشؤون الدولية" },
    { 'id': '35', 'Name': "الشؤون والعلاقات الدولية", 'NameAr': "الشؤون والعلاقات الدولية" },
    { 'id': '36', 'Name': "الصحافة", 'NameAr': "الصحافة" },
    { 'id': '37', 'Name': "الصحة العامة", 'NameAr': "الصحة العامة" },
    { 'id': '38', 'Name': "الطب", 'NameAr': "الطب" },
    { 'id': '39', 'Name': "العلاقات الدولية", 'NameAr': "العلاقات الدولية" },
    { 'id': '40', 'Name': "العلوم البيولوجية", 'NameAr': "العلوم البيولوجية" },
    { 'id': '41', 'Name': "العلوم البيئية", 'NameAr': "العلوم البيئية" },
    { 'id': '42', 'Name': "العلوم الحيوية الطبية", 'NameAr': "العلوم الحيوية الطبية" },
    { 'id': '43', 'Name': "العلوم السياسية", 'NameAr': "العلوم السياسية" },
    { 'id': '44', 'Name': "العلوم السياسية والحكومة", 'NameAr': "العلوم السياسية والحكومة" },
    { 'id': '46', 'Name': "العمارة", 'NameAr': "العمارة" },
    { 'id': '47', 'Name': "الفيزياء", 'NameAr': "الفيزياء" },
    { 'id': '48', 'Name': "القانون", 'NameAr': "القانون" },
    { 'id': '49', 'Name': "الكيمياء", 'NameAr': "الكيمياء" },
    { 'id': '50', 'Name': "اللغة الإنجليزية", 'NameAr': "اللغة الإنجليزية" },
    { 'id': '51', 'Name': "اللغة الإنجليزية المكثفة كلغة أجنبية", 'NameAr': "اللغة الإنجليزية المكثفة كلغة أجنبية" },
    { 'id': '52', 'Name': "اللغة العربية", 'NameAr': "اللغة العربية" },
    { 'id': '53', 'Name': "الماجستير التنفيذي في الطاقة والموارد", 'NameAr': "الماجستير التنفيذي في الطاقة والموارد" },
    { 'id': '54', 'Name': "الماجستير في الآداب في الترجمة السمعية البصرية", 'NameAr': "الماجستير في الآداب في الترجمة السمعية البصرية" },
    { 'id': '55', 'Name': "الماجستير في الآداب في دراسات الترجمة", 'NameAr': "الماجستير في الآداب في دراسات الترجمة" },
    { 'id': '56', 'Name': "الماجستير في التصميم والتخطيط العمراني", 'NameAr': "الماجستير في التصميم والتخطيط العمراني" },
    { 'id': '57', 'Name': "الماجستير في التفسير وعلوم القران", 'NameAr': "الماجستير في التفسير وعلوم القران" },
    { 'id': '58', 'Name': "الماجستير في الصيدلة(دوام كامل)", 'NameAr': "الماجستير في الصيدلة(دوام كامل)" },
    { 'id': '59', 'Name': "الماجستير في الفقه وأصوله", 'NameAr': "الماجستير في الفقه وأصوله" },
    { 'id': '60', 'Name': "الماجستير في القانون الخاص", 'NameAr': "الماجستير في القانون الخاص" },
    { 'id': '61', 'Name': "الماجستير في القانون العام", 'NameAr': "الماجستير في القانون العام" },
    { 'id': '62', 'Name': "المالية", 'NameAr': "المالية" },
    { 'id': '63', 'Name': "المحاسبة", 'NameAr': "المحاسبة" },
    { 'id': '64', 'Name': "المحاسبة والمالية", 'NameAr': "المحاسبة والمالية" },
    { 'id': '65', 'Name': "المراقبة الجوية", 'NameAr': "المراقبة الجوية" },
    { 'id': '66', 'Name': "الهندسة الصناعية والنظم", 'NameAr': "الهندسة الصناعية والنظم" },
    { 'id': '67', 'Name': "الهندسة العامة", 'NameAr': "الهندسة العامة" },
    { 'id': '68', 'Name': "الهندسة الكهربائية", 'NameAr': "الهندسة الكهربائية" },
    { 'id': '69', 'Name': "الهندسة الكهربائية / الإلكترونية / الاتصالات", 'NameAr': "الهندسة الكهربائية / الإلكترونية / الاتصالات" },
    { 'id': '70', 'Name': "الهندسة الكيميائية", 'NameAr': "الهندسة الكيميائية" },
    { 'id': '71', 'Name': "الهندسة المدنية", 'NameAr': "الهندسة المدنية" },
    { 'id': '72', 'Name': "الهندسة المعمارية", 'NameAr': "الهندسة المعمارية" },
    { 'id': '73', 'Name': "الهندسة الميكانيكية", 'NameAr': "الهندسة الميكانيكية" },
    { 'id': '74', 'Name': "الهندسة: ميكانيكية", 'NameAr': "الهندسة: ميكانيكية" },
    { 'id': '75', 'Name': "إدارة الأعمال", 'NameAr': "إدارة الأعمال" },
    { 'id': '76', 'Name': "إدارة الأعمال الدولية", 'NameAr': "إدارة الأعمال الدولية" },
    { 'id': '77', 'Name': "إدارة الأعمال والإدارة، العامة", 'NameAr': "إدارة الأعمال والإدارة، العامة" },
    { 'id': '78', 'Name': "إدارة الأعمال والتسويق", 'NameAr': "إدارة الأعمال والتسويق" },
    { 'id': '79', 'Name': "إدارة الأعمال والموارد البشرية", 'NameAr': "إدارة الأعمال والموارد البشرية" },
    { 'id': '80', 'Name': "إدارة السياحة", 'NameAr': "إدارة السياحة" },
    { 'id': '81', 'Name': "إدارة الضيافة الدولية", 'NameAr': "إدارة الضيافة الدولية" },
    { 'id': '82', 'Name': "إدارة أعمال", 'NameAr': "إدارة أعمال" },
    { 'id': '83', 'Name': "إدارة عمليات المطار", 'NameAr': "إدارة عمليات المطار" },
    { 'id': '84', 'Name': "أنظمة المعلومات", 'NameAr': "أنظمة المعلومات" },
    { 'id': '85', 'Name': "برامج اللغة الإنجليزية", 'NameAr': "برامج اللغة الإنجليزية" },
    { 'id': '86', 'Name': "برنامج الدكتوراه المهنية في القانون(JD)", 'NameAr': "برنامج الدكتوراه المهنية في القانون(JD)" },
    { 'id': '87', 'Name': "برنامج الطب(4 أعوام)", 'NameAr': "برنامج الطب(4 أعوام)" },
    { 'id': '88', 'Name': "برنامج العلوم البيولوجية والعلوم الطبية", 'NameAr': "برنامج العلوم البيولوجية والعلوم الطبية" },
    { 'id': '89', 'Name': "برنامج المؤسسة الدولية", 'NameAr': "برنامج المؤسسة الدولية" },
    { 'id': '90', 'Name': "برنامج في البيئة المستدامة", 'NameAr': "برنامج في البيئة المستدامة" },
    { 'id': '91', 'Name': "برنامج ماقبل الطب(عامان)", 'NameAr': "برنامج ماقبل الطب(عامان)" },
    { 'id': '92', 'Name': "بناء", 'NameAr': "بناء" },
    { 'id': '93', 'Name': "تاريخ الفن", 'NameAr': "تاريخ الفن" },
    { 'id': '94', 'Name': "تأسيسي", 'NameAr': "تأسيسي" },
    { 'id': '95', 'Name': "تصميم الأزياء", 'NameAr': "تصميم الأزياء" },
    { 'id': '96', 'Name': "تصميم الجرافيك", 'NameAr': "تصميم الجرافيك" },
    { 'id': '97', 'Name': "تعليم ابتدائي في مسارات الطفولة المبكرة، اللغة العربية، الرياضيات والعلوم", 'NameAr': "تعليم ابتدائي في مسارات الطفولة المبكرة، اللغة العربية، الرياضيات والعلوم" },
    { 'id': '98', 'Name': "تعليم ابتدائي في مسارات اللغة الإنجليزية", 'NameAr': "تعليم ابتدائي في مسارات اللغة الإنجليزية" },
    { 'id': '99', 'Name': "تعليم ثانوي في مسارات الرياضيات، الفيزياء، الكيمياء، الأحياء", 'NameAr': "تعليم ثانوي في مسارات الرياضيات، الفيزياء، الكيمياء، الأحياء" },
    { 'id': '100', 'Name': "تعليم ثانوي في مسارات اللغة الإنجليزية", 'NameAr': "تعليم ثانوي في مسارات اللغة الإنجليزية" },
    { 'id': '101', 'Name': "تعليم ثانوي في مسارات اللغة العربية، الدراسات الإسلامية، الدراسات الاجتماعية", 'NameAr': "تعليم ثانوي في مسارات اللغة العربية، الدراسات الإسلامية، الدراسات الاجتماعية" },
    { 'id': '102', 'Name': "تغذية الإنسان", 'NameAr': "تغذية الإنسان" },
    { 'id': '103', 'Name': "تمريض", 'NameAr': "تمريض" },
    { 'id': '104', 'Name': "خدمات المطار (لحملة الشهادة الإعدادية)" , 'NameAr': "خدمات المطار (لحملة الشهادة الإعدادية)" },
    { 'id': '105', 'Name': "دبلوم التربية الخاصة", 'NameAr': "دبلوم التربية الخاصة" },
    { 'id': '106', 'Name': "دبلوم التعليم الابتدائي", 'NameAr': "دبلوم التعليم الابتدائي" },
    { 'id': '107', 'Name': "دبلوم التعليم الثانوي", 'NameAr': "دبلوم التعليم الثانوي" },
    { 'id': '108', 'Name': "دبلوم الطفولة المبكرة", 'NameAr': "دبلوم الطفولة المبكرة" },
    { 'id': '109', 'Name': "دكتور صيدلة(دوام جزئي)", 'NameAr': "دكتور صيدلة(دوام جزئي)" },
    { 'id': '110', 'Name': "دكتور صيدلة(دوام كامل)", 'NameAr': "دكتور صيدلة(دوام كامل)" },
    { 'id': '111', 'Name': "دكتوراه في العلوم البيولوجية والبيئية", 'NameAr': "دكتوراه في العلوم البيولوجية والبيئية" },
    { 'id': '112', 'Name': "دكتوراه في دراسات الخليج", 'NameAr': "دكتوراه في دراسات الخليج" },
    { 'id': '113', 'Name': "سياسة الاتصالات", 'NameAr': "سياسة الاتصالات" },
    { 'id': '114', 'Name': "هادة في التعليم في مرحلة الطفولة المبكرة", 'NameAr': "هادة في التعليم في مرحلة الطفولة المبكرة" },
    { 'id': '115', 'Name': "صيدلة", 'NameAr': "صيدلة" },
    { 'id': '116', 'Name': "علم الاجتماع", 'NameAr': "علم الاجتماع" },
    { 'id': '117', 'Name': "علم الأحياء الحاسوبي", 'NameAr': "علم الأحياء الحاسوبي" },
    { 'id': '118', 'Name': "علم الأغذية", 'NameAr': "علم الأغذية" },
    { 'id': '119', 'Name': "علم الأوبئة", 'NameAr': "علم الأوبئة" },
    { 'id': '120', 'Name': "علم الحيوان", 'NameAr': "علم الحيوان" },
    { 'id': '121', 'Name': "علم الكمبيوتر", 'NameAr': "علم الكمبيوتر" },
    { 'id': '122', 'Name': "علم النفس", 'NameAr': "علم النفس" },
    { 'id': '123', 'Name': "علم الوراثة العام", 'NameAr': "علم الوراثة العام" },
    { 'id': '124', 'Name': "علوم الحاسب", 'NameAr': "علوم الحاسب" },
    { 'id': '125', 'Name': "علوم الحاسوب", 'NameAr': "علوم الحاسوب" },
    { 'id': '126', 'Name': "علوم الرياضة", 'NameAr': "علوم الرياضة" },
    { 'id': '127', 'Name': "علوم شرطية", 'NameAr': "علوم شرطية" },
    { 'id': '128', 'Name': "فنون(الزخرفة، التصوير)", 'NameAr': "فنون(الزخرفة، التصوير)" },
    { 'id': '129', 'Name': "قانون", 'NameAr': "قانون" },
    { 'id': '130', 'Name': "كليات الفنون الحرة", 'NameAr': "كليات الفنون الحرة" },
    { 'id': '131', 'Name': "كورسات مهنية", 'NameAr': "كورسات مهنية" },
    { 'id': '132', 'Name': "ليسانس الآداب في الإدارة العامة", 'NameAr': "ليسانس الآداب في الإدارة العامة" },
    { 'id': '133', 'Name': "ماجستير الإحصاء التطبيقي", 'NameAr': "ماجستير الإحصاء التطبيقي" },
    { 'id': '134', 'Name': "ماجستير الآداب في الدراسات الإسلامية تخصص الفقه المعاصر", 'NameAr': "ماجستير الآداب في الدراسات الإسلامية تخصص الفقه المعاصر" },
    { 'id': '135', 'Name': "ماجستير الآداب في الدراسات الإسلامية تخصص مقارنة الأديان", 'NameAr': "ماجستير الآداب في الدراسات الإسلامية تخصص مقارنة الأديان" },
    { 'id': '136', 'Name': "ماجستير الآداب في السياسة العامة في الإسلام", 'NameAr': "ماجستير الآداب في السياسة العامة في الإسلام" },
    { 'id': '137', 'Name': "ماجستير الآداب في الفكر الإسلامي والمجتمعات المسلمة المعاصرة", 'NameAr': "ماجستير الآداب في الفكر الإسلامي والمجتمعات المسلمة المعاصرة" },
    { 'id': '138', 'Name': "ماجستير الآداب في اللغة العربية وآدابها", 'NameAr': "ماجستير الآداب في اللغة العربية وآدابها" },
    { 'id': '139', 'Name': "ماجستير الآداب في المناهج الدراسية والتدريس والتقييم", 'NameAr': "ماجستير الآداب في المناهج الدراسية والتدريس والتقييم" },
    { 'id': '140', 'Name': "ماجستير الآداب في دراسات الخليج", 'NameAr': "ماجستير الآداب في دراسات الخليج" },
    { 'id': '141', 'Name': "ماجستير التربية في التربية الخاصة", 'NameAr': "ماجستير التربية في التربية الخاصة" },
    { 'id': '142', 'Name': "ماجستير التربية في القيادة التربوية", 'NameAr': "ماجستير التربية في القيادة التربوية" },
    { 'id': '143', 'Name': "ماجستير التسويق", 'NameAr': "ماجستير التسويق" },
    { 'id': '144', 'Name': "ماجستير الصحة العامة", 'NameAr': "ماجستير الصحة العامة" },
    { 'id': '145', 'Name': "ماجستير العلوم في الإدارة الهندسية", 'NameAr': "ماجستير العلوم في الإدارة الهندسية" },
    { 'id': '146', 'Name': "ماجستير العلوم في التمويل الإسلامي", 'NameAr': "ماجستير العلوم في التمويل الإسلامي" },
    { 'id': '147', 'Name': "ماجستير العلوم في الحوسبة", 'NameAr': "ماجستير العلوم في الحوسبة" },
    { 'id': '148', 'Name': "ماجستير العلوم في العلوم البيئية", 'NameAr': "ماجستير العلوم في العلوم البيئية" },
    { 'id': '149', 'Name': "ماجستير العلوم في العلوم الحيوية الطبية", 'NameAr': "ماجستير العلوم في العلوم الحيوية الطبية" },
    { 'id': '150', 'Name': "ماجستير العلوم في الهندسة البيئية", 'NameAr': "ماجستير العلوم في الهندسة البيئية" },
    { 'id': '151', 'Name': "ماجستير العلوم في الهندسة الكهربائية", 'NameAr': "ماجستير العلوم في الهندسة الكهربائية" },
    { 'id': '152', 'Name': "ماجستير العلوم في الهندسة المدنية", 'NameAr': "ماجستير العلوم في الهندسة المدنية" },
    { 'id': '153', 'Name': "ماجستير العلوم في الهندسة الميكانيكية", 'NameAr': "ماجستير العلوم في الهندسة الميكانيكية" },
    { 'id': '154', 'Name': "ماجستير المحاسبة", 'NameAr': "ماجستير المحاسبة" },
    { 'id': '155', 'Name': "ماجستير إدارة الأعمال", 'NameAr': "ماجستير إدارة الأعمال" },
    { 'id': '156', 'Name': "ماجستير علوم المواد والتكنولوجيا", 'NameAr': "ماجستير علوم المواد والتكنولوجيا" },
    { 'id': '157', 'Name': "ماجستير في التصميم الحضري والعمارة في المجتمعات الإسلامية", 'NameAr': "ماجستير في التصميم الحضري والعمارة في المجتمعات الإسلامية" },
    { 'id': '158', 'Name': "مدارس إدارة الأعمال", 'NameAr': "مدارس إدارة الأعمال" },
    { 'id': '159', 'Name': "مسار - الأعمال", 'NameAr': "مسار - الأعمال" },
    { 'id': '160', 'Name': "مشارك في العلوم", 'NameAr': "مشارك في العلوم" },
    { 'id': '161', 'Name': "مشارك في العلوم التطبيقية في إدارة الجمارك", 'NameAr': "مشارك في العلوم التطبيقية في إدارة الجمارك" },
    { 'id': '162', 'Name': "مشارك في العلوم التطبيقية في إدارة المعلومات الصحية", 'NameAr': "مشارك في العلوم التطبيقية في إدارة المعلومات الصحية" },
    { 'id': '163', 'Name': "مشارك في الفنون", 'NameAr': "مشارك في الفنون" },
    { 'id': '164', 'Name': "مشارك في الفنون - مسار اللغة العربية", 'NameAr': "مشارك في الفنون - مسار اللغة العربية" },
    { 'id': '165', 'Name': "مشارك في الفنون في الإدارة العامة", 'NameAr': "مشارك في الفنون في الإدارة العامة" },
    { 'id': '166', 'Name': "نظم معلومات الأجهزة", 'NameAr': "نظم معلومات الأجهزة" },
    { 'id': '167', 'Name': "نظم معلومات الحاسوب", 'NameAr': "نظم معلومات الحاسوب" },
    { 'id': '168', 'Name': "هندسة البترول", 'NameAr': "هندسة البترول" },
    { 'id': '169', 'Name': "هندسة الحاسب", 'NameAr': "هندسة الحاسب" },
    { 'id': '170', 'Name': "هندسة الحاسوب", 'NameAr': "هندسة الحاسوب" },
    { 'id': '171', 'Name': "هندسة الكمبيوتر، عامة", 'NameAr': "هندسة الكمبيوتر، عامة" },
    { 'id': '172', 'Name': "هندسة إلكترونيات المطار", 'NameAr': "هندسة إلكترونيات المطار" },
    { 'id': '181', 'Name': "ادارة الامن", 'NameAr': "ادارة الامن" },
    { 'id': '201', 'Name': "طيار", 'NameAr': "طيار" },
    { 'id': '202', 'Name': "تربية بدنية وعلوم رياضية", 'NameAr': "تربية بدنية وعلوم رياضية" },
    { 'id': '203', 'Name': "إدارة لوجستيات التجارة والنقل الدولي", 'NameAr': "إدارة لوجستيات التجارة والنقل الدولي" },
    { 'id': '221', 'Name': "إدارة الاعمال والاستثمار", 'NameAr': "إدارة الاعمال والاستثمار" },
    { 'id': '222', 'Name': "الدبلوم المشارك في الأداب", 'NameAr': "الدبلوم المشارك في الأداب" },
    { 'id': '241', 'Name': "السياحة", 'NameAr': "السياحة" },
    { 'id': '261', 'Name': "هندسة طائرات", 'NameAr': "هندسة طائرات" },
    { 'id': '262', 'Name': "هندسة هليكوبتر", 'NameAr': "هندسة هليكوبتر" },
    { 'id': '263', 'Name': "إدارة وعلوم الإطفاء", 'NameAr': "إدارة وعلوم الإطفاء" },
    { 'id': '264', 'Name': "إدارة موانئ", 'NameAr': "إدارة موانئ" },
    { 'id': '265', 'Name': "هندسة إطفاء", 'NameAr': "هندسة إطفاء" },
    { 'id': '266', 'Name': "ماجستيرفي إدارةوحدة الأعمال الإستراتجية", 'NameAr': "ماجستيرفي إدارةوحدة الأعمال الإستراتجية" },
    { 'id': '281', 'Name': "دبلوم كترونيات الطيران", 'NameAr': "دبلوم كترونيات الطيران" },
    { 'id': '282', 'Name': "هندسة كيميائية", 'NameAr': "هندسة كيميائية" },
    { 'id': '283', 'Name': "البكالوريوس في الاداب", 'NameAr': "البكالوريوس في الاداب" },
    { 'id': '284', 'Name': "دبلوم الكترونيات الطيران", 'NameAr': "دبلوم الكترونيات الطيران" },
    { 'id': '301', 'Name': "تكنولوجيا هندسة الإتصالات", 'NameAr': "تكنولوجيا هندسة الإتصالات" },
    { 'id': '321', 'Name': "الآداب في العلاقات العامة", 'NameAr': "الآداب في العلاقات العامة" },
    { 'id': '322', 'Name': "نظم المعلومات الادارية", 'NameAr': "نظم المعلومات الادارية" },
    { 'id': '323', 'Name': "تكنولوجيا التشييد", 'NameAr': "تكنولوجيا التشييد" },
    { 'id': '324', 'Name': "علم المعلومات والمكتبات", 'NameAr': "علم المعلومات والمكتبات" },
    { 'id': '325', 'Name': "إدارة الطيران", 'NameAr': "إدارة الطيران" },
    { 'id': '326', 'Name': "ماجستير إدارة الاعمال", 'NameAr': "ماجستير إدارة الاعمال" },
    { 'id': '327', 'Name': "إدارة المكاتب", 'NameAr': "إدارة المكاتب" },
    { 'id': '328', 'Name': "جغرافيا / تخطيط عمراني", 'NameAr': "جغرافيا / تخطيط عمراني" },
    { 'id': '329', 'Name': "ماجستير إدارة استراتيجية", 'NameAr': "ماجستير إدارة استراتيجية" },
    { 'id': '341', 'Name': "ماجستير الإدارة", 'NameAr': "ماجستير الإدارة" },
    { 'id': '342', 'Name': "تكنولوجيا المعلومات والاتصالات", 'NameAr': "تكنولوجيا المعلومات والاتصالات" },
    { 'id': '343', 'Name': "طب بشري", 'NameAr': "طب بشري" },
    { 'id': '344', 'Name': "هندسة البرمجيات", 'NameAr': "هندسة البرمجيات" },
    { 'id': '361', 'Name': "إدارة فنادق", 'NameAr': "إدارة فنادق" },
    { 'id': '381', 'Name': "طب جراحة الفم والاسنان", 'NameAr': "طب جراحة الفم والاسنان" },
    { 'id': '382', 'Name': "تكنولوجيا المعلومات التجارية", 'NameAr': "تكنولوجيا المعلومات التجارية" },
    { 'id': '383', 'Name': "طب وجراحة", 'NameAr': "طب وجراحة" },
    { 'id': '384', 'Name': "التصوير الشعاعي الطبي", 'NameAr': "التصوير الشعاعي الطبي" },
    { 'id': '385', 'Name': "هندسة بحرية", 'NameAr': "هندسة بحرية" },
    { 'id': '386', 'Name': "العلوم الزراعية", 'NameAr': "العلوم الزراعية" },
    { 'id': '387', 'Name': "اصول دين", 'NameAr': "اصول دين" },
    { 'id': '401', 'Name': "هندسة مناجم", 'NameAr': "هندسة مناجم" },
    { 'id': '421', 'Name': "ادارة انشاءات", 'NameAr': "ادارة انشاءات" },
    { 'id': '441', 'Name': "تكنولوجيا البترول", 'NameAr': "تكنولوجيا البترول" },
    { 'id': '442', 'Name': "تكنولوجيا معلومات الحاسب", 'NameAr': "تكنولوجيا معلومات الحاسب" },
    { 'id': '461', 'Name': "الهندسة الالكترونية والكمبيوتر", 'NameAr': "الهندسة الالكترونية والكمبيوتر" },
    { 'id': '462', 'Name': "دراسات مالية ومصرفية", 'NameAr': "دراسات مالية ومصرفية" },
    { 'id': '463', 'Name': "بكالوريوس / التعليم الثانوي", 'NameAr': "بكالوريوس / التعليم الثانوي" },
    { 'id': '464', 'Name': "إدارة الرعاية الصحية", 'NameAr': "إدارة الرعاية الصحية" },
    { 'id': '465', 'Name': "القضاء", 'NameAr': "القضاء" },
    { 'id': '466', 'Name': "علم الاسعافات", 'NameAr': "علم الاسعافات" },
    { 'id': '467', 'Name': "اتصالات لاسلكية", 'NameAr': "اتصالات لاسلكية" },
    { 'id': '468', 'Name': "مراقبة الطرق", 'NameAr': "مراقبة الطرق" },
    { 'id': '469', 'Name': "قانون الادارة العمومية", 'NameAr': "قانون الادارة العمومية" },
    { 'id': '481', 'Name': "علم الانسان", 'NameAr': "علم الانسان" },
    { 'id': '501', 'Name': "دبلوم في عمليات المطارات المتقدمة", 'NameAr': "دبلوم في عمليات المطارات المتقدمة" },
    { 'id': '521', 'Name': "مختبرات كيميائية", 'NameAr': "مختبرات كيميائية" },
    { 'id': '522', 'Name': "الماجستير في الفقة المقارن", 'NameAr': "الماجستير في الفقة المقارن" },
    { 'id': '523', 'Name': "دكتواره في الفقه واصوله", 'NameAr': "دكتواره في الفقه واصوله" },
    { 'id': '541', 'Name': "الاكاديمية العربية للعلوم المالية والمصرفية", 'NameAr': "الاكاديمية العربية للعلوم المالية والمصرفية" },
    { 'id': '542', 'Name': "ميكانيك مركبات", 'NameAr': "ميكانيك مركبات" },
    { 'id': '543', 'Name': "هندسة الانظمة", 'NameAr': "هندسة الانظمة" },
    { 'id': '561', 'Name': "ادارة مالية ومصرفية", 'NameAr': "ادارة مالية ومصرفية" },
    { 'id': '581', 'Name': "المسح الكمي", 'NameAr': "المسح الكمي" },
    { 'id': '582', 'Name': "الدبلوم المشارك في العلوم", 'NameAr': "الدبلوم المشارك في العلوم" },
    { 'id': '601', 'Name': "فني تقني", 'NameAr': "فني تقني" },
    { 'id': '602', 'Name': "تكنولوجيا الالات او الاجهزه", 'NameAr': "تكنولوجيا الالات او الاجهزه" },
    { 'id': '603', 'Name': "اشعه طبيه", 'NameAr': "اشعه طبيه" },
    { 'id': '604', 'Name': "التحول الاجتماعي", 'NameAr': "التحول الاجتماعي" },
    { 'id': '605', 'Name': "حقوق", 'NameAr': "حقوق" },
    { 'id': '606', 'Name': "علاقات دوليه", 'NameAr': "علاقات دوليه" },
    { 'id': '607', 'Name': "موارد بشريه", 'NameAr': "موارد بشريه" },
    { 'id': '608', 'Name': "العلوم السياسيه", 'NameAr': "العلوم السياسيه" },
    { 'id': '609', 'Name': "هندسه اتصالات", 'NameAr': "هندسه اتصالات" },
    { 'id': '610', 'Name': "هندسه مواد", 'NameAr': "هندسه مواد" },
    { 'id': '611', 'Name': "الماجستير في ادارة تكنولوجيا المعلومات", 'NameAr': "الماجستير في ادارة تكنولوجيا المعلومات" },
    { 'id': '612', 'Name': "هندسه ميكانيكيه", 'NameAr': "هندسه ميكانيكيه" },
    { 'id': '613', 'Name': "ماجستير الدراسات الاسلاميه فقه معاصر", 'NameAr': "ماجستير الدراسات الاسلاميه فقه معاصر" },
    { 'id': '621', 'Name': "ادارة اعمال جمركيه", 'NameAr': "ادارة اعمال جمركيه" },
    { 'id': '622', 'Name': "اداره انظمه الكمبيوتر", 'NameAr': "اداره انظمه الكمبيوتر" },
    { 'id': '623', 'Name': "ماجستير في الادارة الهندسيه", 'NameAr': "ماجستير في الادارة الهندسيه" },
    { 'id': '641', 'Name': "تكنولوجيا فيلم", 'NameAr': "تكنولوجيا فيلم" },
    { 'id': '643', 'Name': "الانترنت مطور التطبيق", 'NameAr': "الانترنت مطور التطبيق" },
    { 'id': '644', 'Name': "دبلوم تقنية المعلومات", 'NameAr': "دبلوم تقنية المعلومات" },
    { 'id': '646', 'Name': "مشغل فني", 'NameAr': "مشغل فني" },
    { 'id': '647', 'Name': "الاتصال", 'NameAr': "الاتصال" },
    { 'id': '648', 'Name': "دبلوم فنى كيميائى", 'NameAr': "دبلوم فنى كيميائى" },
    { 'id': '649', 'Name': "ماجستير في هندسة البترول", 'NameAr': "ماجستير في هندسة البترول" },
    { 'id': '661', 'Name': "ماجستير في التمويل", 'NameAr': "ماجستير في التمويل" },
    { 'id': '662', 'Name': "دبلوم التكنولوجي", 'NameAr': "دبلوم التكنولوجي" },
    { 'id': '663', 'Name': "اللغات", 'NameAr': "اللغات" },
    { 'id': '665', 'Name': "تكنولوجيا الهندسه", 'NameAr': "تكنولوجيا الهندسه" },
    { 'id': '681', 'Name': "هندسه الالات الدقيقه", 'NameAr': "هندسه الالات الدقيقه" },
    { 'id': '682', 'Name': "العلوم", 'NameAr': "العلوم" },
    { 'id': '701', 'Name': "ادارة انشطة دولية", 'NameAr': "ادارة انشطة دولية" },
    { 'id': '721', 'Name': "علم الاحياء", 'NameAr': "علم الاحياء" },
    { 'id': '741', 'Name': "تقنيه الشبكات", 'NameAr': "تقنيه الشبكات" },
    { 'id': '761', 'Name': "نظم المعلومات الجغرافيه", 'NameAr': "نظم المعلومات الجغرافيه" },
    { 'id': '762', 'Name': "الدراسات البحريه", 'NameAr': "الدراسات البحريه" },
    { 'id': '763', 'Name': "الهندسه البيئيه", 'NameAr': "الهندسه البيئيه" },
    { 'id': '764', 'Name': "الهندسه الكهروميكانيكا", 'NameAr': "الهندسه الكهروميكانيكا" },
    { 'id': '765', 'Name': "اداره واقتصاد البترول", 'NameAr': "اداره واقتصاد البترول" },
    { 'id': '766', 'Name': "الملاحه البحريه", 'NameAr': "الملاحه البحريه" },
    { 'id': '767', 'Name': "هندسه التصنيع", 'NameAr': "هندسه التصنيع" },
    { 'id': '769', 'Name': "هندسه القياس والتحكم", 'NameAr': "هندسه القياس والتحكم" },
    { 'id': '770', 'Name': "علم الجريمه", 'NameAr': "علم الجريمه" },
    { 'id': '781', 'Name': "العلاقات العامه والإعلان", 'NameAr': "العلاقات العامه والإعلان" },
    { 'id': '801', 'Name': "ماجستير اداره وتخطيط", 'NameAr': "ماجستير اداره وتخطيط" },
    { 'id': '821', 'Name': "الجيولوجيا - علم الأرض", 'NameAr': "الجيولوجيا - علم الأرض" },
    { 'id': '841', 'Name': "هندسه تكنولوجيا المعلومات", 'NameAr': "هندسه تكنولوجيا المعلومات" },
    { 'id': '861', 'Name': "بكالوريوس الهندسه المدنية", 'NameAr': "بكالوريوس الهندسه المدنية" },
    { 'id': '881', 'Name': "ماجستير في العقارات", 'NameAr': "ماجستير في العقارات" },
    { 'id': '901', 'Name': "الهندسه في القياس والتحكم", 'NameAr': "الهندسه في القياس والتحكم" },
    { 'id': '921', 'Name': "ادارة تسيير المشاريع", 'NameAr': "ادارة تسيير المشاريع" },
    { 'id': '941', 'Name': "ادارة واقتصاد", 'NameAr': "ادارة واقتصاد" },
    { 'id': '942', 'Name': "علم الحديث", 'NameAr': "علم الحديث" },
    { 'id': '961', 'Name': "هندسه نوويه", 'NameAr': "هندسه نوويه" },
    { 'id': '962', 'Name': "الفلسفه الرئيسيه", 'NameAr': "الفلسفه الرئيسيه" },
    { 'id': '981', 'Name': "ماجستير في العلوم", 'NameAr': "ماجستير في العلوم" },
    { 'id': '982', 'Name': "تنمية  مهارات المفتشين  البيئين", 'NameAr': "تنمية  مهارات المفتشين  البيئين" },
    { 'id': '984', 'Name': "الادارة والقياده", 'NameAr': "الادارة والقياده" },
    { 'id': '985', 'Name': "هندسه طيران", 'NameAr': "هندسه طيران" },
    { 'id': '986', 'Name': "الاداره الماليه والمحاسبه", 'NameAr': "الاداره الماليه والمحاسبه" },
    { 'id': '1001', 'Name': "الحوسبه التطبيقيه", 'NameAr': "الحوسبه التطبيقيه" },
    { 'id': '1021', 'Name': "هندسه التعدين", 'NameAr': "هندسه التعدين" },
    { 'id': '1041', 'Name': "مشغل عمليات كيميائي", 'NameAr': "مشغل عمليات كيميائي" },
    { 'id': '1042', 'Name': "كهربائي تمديدات كهربائيه", 'NameAr': "كهربائي تمديدات كهربائيه" },
    { 'id': '1061', 'Name': "اعلاميه التصرف", 'NameAr': "اعلاميه التصرف" },
    { 'id': '1062', 'Name': "ادب امريكي", 'NameAr': "ادب امريكي" },
    { 'id': '1081', 'Name': "الشريعه", 'NameAr': "الشريعه" },
    { 'id': '1101', 'Name': "الاعمال الالكترونيه العالميه", 'NameAr': "الاعمال الالكترونيه العالميه" },
    { 'id': '1121', 'Name': "الهندسه الالكترونيه", 'NameAr': "الهندسه الالكترونيه" },
    { 'id': '1141', 'Name': "دراسات دبلوماسيه", 'NameAr': "دراسات دبلوماسيه" },
    { 'id': '1161', 'Name': "ماجستير الموارد البشرية", 'NameAr': "ماجستير الموارد البشرية" },
    { 'id': '1162', 'Name': "إخراج سينمائي", 'NameAr': "إخراج سينمائي" },
    { 'id': '1181', 'Name': "هندسة طرق", 'NameAr': "هندسة طرق" },
    { 'id': '1201', 'Name': "إدارة كوارث", 'NameAr': "إدارة كوارث" },
    { 'id': '33', 'Name': "السياسة والقوانين", 'NameAr': "السياسة والقوانين" },
    { 'id': '34', 'Name': "الشؤون الدولية", 'NameAr': "الشؤون الدولية" },
    { 'id': '35', 'Name': "الشؤون والعلاقات الدولية", 'NameAr': "الشؤون والعلاقات الدولية" },
    { 'id': '36', 'Name': "الصحافة", 'NameAr': "الصحافة" },
    { 'id': '37', 'Name': "الصحة العامة", 'NameAr': "الصحة العامة" },
    { 'id': '38', 'Name': "الطب", 'NameAr': "الطب" },
    { 'id': '39', 'Name': "العلاقات الدولية", 'NameAr': "العلاقات الدولية" },
    { 'id': '40', 'Name': "العلوم البيولوجية", 'NameAr': "العلوم البيولوجية" },
    { 'id': '41', 'Name': "العلوم البيئية", 'NameAr': "العلوم البيئية" },
    { 'id': '42', 'Name': "العلوم الحيوية الطبية", 'NameAr': "العلوم الحيوية الطبية" },
    { 'id': '43', 'Name': "العلوم السياسية", 'NameAr': "العلوم السياسية" },
    { 'id': '44', 'Name': "العلوم السياسية والحكومة", 'NameAr': "العلوم السياسية والحكومة" },
    { 'id': '46', 'Name': "العمارة", 'NameAr': "العمارة" },
    { 'id': '47', 'Name': "الفيزياء", 'NameAr': "الفيزياء" },
    { 'id': '48', 'Name': "القانون", 'NameAr': "القانون" },
    { 'id': '49', 'Name': "الكيمياء", 'NameAr': "الكيمياء" },
    { 'id': '50', 'Name': "اللغة الإنجليزية", 'NameAr': "اللغة الإنجليزية" },
    { 'id': '51', 'Name': "اللغة الإنجليزية المكثفة كلغة أجنبية", 'NameAr': "اللغة الإنجليزية المكثفة كلغة أجنبية" },
    { 'id': '52', 'Name': "اللغة العربية", 'NameAr': "اللغة العربية" },
    { 'id': '53', 'Name': "الماجستير التنفيذي في الطاقة والموارد", 'NameAr': "الماجستير التنفيذي في الطاقة والموارد" },
    { 'id': '54', 'Name': "الماجستير في الآداب في الترجمة السمعية البصرية", 'NameAr': "الماجستير في الآداب في الترجمة السمعية البصرية" },
    { 'id': '55', 'Name': "الماجستير في الآداب في دراسات الترجمة", 'NameAr': "الماجستير في الآداب في دراسات الترجمة" },
    { 'id': '56', 'Name': "الماجستير في التصميم والتخطيط العمراني", 'NameAr': "الماجستير في التصميم والتخطيط العمراني" },
    { 'id': '57', 'Name': "الماجستير في التفسير وعلوم القران", 'NameAr': "الماجستير في التفسير وعلوم القران" },
    { 'id': '58', 'Name': "الماجستير في الصيدلة(دوام كامل)", 'NameAr': "الماجستير في الصيدلة(دوام كامل)" },
    { 'id': '59', 'Name': "الماجستير في الفقه وأصوله", 'NameAr': "الماجستير في الفقه وأصوله" },
    { 'id': '60', 'Name': "الماجستير في القانون الخاص", 'NameAr': "الماجستير في القانون الخاص" },
    { 'id': '61', 'Name': "الماجستير في القانون العام", 'NameAr': "الماجستير في القانون العام" },
    { 'id': '62', 'Name': "المالية", 'NameAr': "المالية" },
    { 'id': '63', 'Name': "المحاسبة", 'NameAr': "المحاسبة" },
    { 'id': '64', 'Name': "المحاسبة والمالية", 'NameAr': "المحاسبة والمالية" },
    { 'id': '65', 'Name': "المراقبة الجوية", 'NameAr': "المراقبة الجوية" },
    { 'id': '66', 'Name': "الهندسة الصناعية والنظم", 'NameAr': "الهندسة الصناعية والنظم" },
    { 'id': '67', 'Name': "الهندسة العامة", 'NameAr': "الهندسة العامة" },
    { 'id': '68', 'Name': "الهندسة الكهربائية", 'NameAr': "الهندسة الكهربائية" },
    { 'id': '69', 'Name': "الهندسة الكهربائية / الإلكترونية / الاتصالات", 'NameAr': "الهندسة الكهربائية / الإلكترونية / الاتصالات" },
    { 'id': '70', 'Name': "الهندسة الكيميائية", 'NameAr': "الهندسة الكيميائية" },
    { 'id': '71', 'Name': "الهندسة المدنية", 'NameAr': "الهندسة المدنية" },
    { 'id': '72', 'Name': "الهندسة المعمارية", 'NameAr': "الهندسة المعمارية" },
    { 'id': '73', 'Name': "الهندسة الميكانيكية", 'NameAr': "الهندسة الميكانيكية" },
    { 'id': '74', 'Name': "الهندسة: ميكانيكية", 'NameAr': "الهندسة: ميكانيكية" },
    { 'id': '75', 'Name': "إدارة الأعمال", 'NameAr': "إدارة الأعمال" },
    { 'id': '76', 'Name': "إدارة الأعمال الدولية", 'NameAr': "إدارة الأعمال الدولية" },
    { 'id': '77', 'Name': "إدارة الأعمال والإدارة، العامة", 'NameAr': "إدارة الأعمال والإدارة، العامة" },
    { 'id': '78', 'Name': "إدارة الأعمال والتسويق", 'NameAr': "إدارة الأعمال والتسويق" },
    { 'id': '79', 'Name': "إدارة الأعمال والموارد البشرية", 'NameAr': "إدارة الأعمال والموارد البشرية" },
    { 'id': '80', 'Name': "إدارة السياحة", 'NameAr': "إدارة السياحة" },
    { 'id': '81', 'Name': "إدارة الضيافة الدولية", 'NameAr': "إدارة الضيافة الدولية" },
    { 'id': '82', 'Name': "إدارة أعمال", 'NameAr': "إدارة أعمال" },
    { 'id': '83', 'Name': "إدارة عمليات المطار", 'NameAr': "إدارة عمليات المطار" },
    { 'id': '84', 'Name': "أنظمة المعلومات", 'NameAr': "أنظمة المعلومات" },
    { 'id': '85', 'Name': "برامج اللغة الإنجليزية", 'NameAr': "برامج اللغة الإنجليزية" },
    { 'id': '86', 'Name': "برنامج الدكتوراه المهنية في القانون(JD)", 'NameAr': "برنامج الدكتوراه المهنية في القانون(JD)" },
    { 'id': '87', 'Name': "برنامج الطب(4 أعوام)", 'NameAr': "برنامج الطب(4 أعوام)" },
    { 'id': '88', 'Name': "برنامج العلوم البيولوجية والعلوم الطبية", 'NameAr': "برنامج العلوم البيولوجية والعلوم الطبية" },
    { 'id': '89', 'Name': "برنامج المؤسسة الدولية", 'NameAr': "برنامج المؤسسة الدولية" },
    { 'id': '90', 'Name': "برنامج في البيئة المستدامة", 'NameAr': "برنامج في البيئة المستدامة" },
    { 'id': '91', 'Name': "برنامج ماقبل الطب(عامان)", 'NameAr': "برنامج ماقبل الطب(عامان)" },
    { 'id': '92', 'Name': "بناء", 'NameAr': "بناء" },
    { 'id': '93', 'Name': "تاريخ الفن", 'NameAr': "تاريخ الفن" },
    { 'id': '94', 'Name': "تأسيسي", 'NameAr': "تأسيسي" },
    { 'id': '95', 'Name': "تصميم الأزياء", 'NameAr': "تصميم الأزياء" },
    { 'id': '96', 'Name': "تصميم الجرافيك", 'NameAr': "تصميم الجرافيك" },
    { 'id': '97', 'Name': "تعليم ابتدائي في مسارات الطفولة المبكرة، اللغة العربية، الرياضيات والعلوم", 'NameAr': "تعليم ابتدائي في مسارات الطفولة المبكرة، اللغة العربية، الرياضيات والعلوم" },
    { 'id': '98', 'Name': "تعليم ابتدائي في مسارات اللغة الإنجليزية", 'NameAr': "تعليم ابتدائي في مسارات اللغة الإنجليزية" },
    { 'id': '99', 'Name': "تعليم ثانوي في مسارات الرياضيات، الفيزياء، الكيمياء، الأحياء", 'NameAr': "تعليم ثانوي في مسارات الرياضيات، الفيزياء، الكيمياء، الأحياء" },
    { 'id': '100', 'Name': "تعليم ثانوي في مسارات اللغة الإنجليزية", 'NameAr': "تعليم ثانوي في مسارات اللغة الإنجليزية" },
    { 'id': '101', 'Name': "تعليم ثانوي في مسارات اللغة العربية، الدراسات الإسلامية، الدراسات الاجتماعية", 'NameAr': "تعليم ثانوي في مسارات اللغة العربية، الدراسات الإسلامية، الدراسات الاجتماعية" },
    { 'id': '102', 'Name': "تغذية الإنسان", 'NameAr': "تغذية الإنسان" },
    { 'id': '103', 'Name': "تمريض", 'NameAr': "تمريض" },
    { 'id': '104', 'Name': "خدمات المطار (لحملة الشهادة الإعدادية)", 'NameAr': "خدمات المطار (لحملة الشهادة الإعدادية)" },
    { 'id': '105', 'Name': "دبلوم التربية الخاصة", 'NameAr': "دبلوم التربية الخاصة" },
    { 'id': '106', 'Name': "دبلوم التعليم الابتدائي", 'NameAr': "دبلوم التعليم الابتدائي" },
    { 'id': '107', 'Name': "دبلوم التعليم الثانوي", 'NameAr': "دبلوم التعليم الثانوي" },
    { 'id': '108', 'Name': "دبلوم الطفولة المبكرة", 'NameAr': "دبلوم الطفولة المبكرة" },
    { 'id': '109', 'Name': "دكتور صيدلة(دوام جزئي)", 'NameAr': "دكتور صيدلة(دوام جزئي)" },
    { 'id': '110', 'Name': "دكتور صيدلة(دوام كامل)", 'NameAr': "دكتور صيدلة(دوام كامل)" },
    { 'id': '111', 'Name': "دكتوراه في العلوم البيولوجية والبيئية", 'NameAr': "دكتوراه في العلوم البيولوجية والبيئية" },
    { 'id': '112', 'Name': "دكتوراه في دراسات الخليج", 'NameAr': "دكتوراه في دراسات الخليج" },
    { 'id': '113', 'Name': "سياسة الاتصالات", 'NameAr': "سياسة الاتصالات" },
    { 'id': '114', 'Name': "هادة في التعليم في مرحلة الطفولة المبكرة", 'NameAr': "هادة في التعليم في مرحلة الطفولة المبكرة" },
    { 'id': '115', 'Name': "صيدلة", 'NameAr': "صيدلة" },
    { 'id': '116', 'Name': "علم الاجتماع", 'NameAr': "علم الاجتماع" },
    { 'id': '117', 'Name': "علم الأحياء الحاسوبي", 'NameAr': "علم الأحياء الحاسوبي" },
    { 'id': '118', 'Name': "علم الأغذية", 'NameAr': "علم الأغذية" },
    { 'id': '119', 'Name': "علم الأوبئة", 'NameAr': "علم الأوبئة" },
    { 'id': '120', 'Name': "علم الحيوان", 'NameAr': "علم الحيوان" },
    { 'id': '121', 'Name': "علم الكمبيوتر", 'NameAr': "علم الكمبيوتر" },
    { 'id': '122', 'Name': "علم النفس", 'NameAr': "علم النفس" },
    { 'id': '123', 'Name': "علم الوراثة العام", 'NameAr': "علم الوراثة العام" },
    { 'id': '124', 'Name': "علوم الحاسب", 'NameAr': "علوم الحاسب" },
    { 'id': '125', 'Name': "علوم الحاسوب", 'NameAr': "علوم الحاسوب" },
    { 'id': '126', 'Name': "علوم الرياضة", 'NameAr': "علوم الرياضة" },
    { 'id': '127', 'Name': "علوم شرطية", 'NameAr': "علوم شرطية" },
    { 'id': '128', 'Name': "فنون(الزخرفة، التصوير)", 'NameAr': "فنون(الزخرفة، التصوير)" },
    { 'id': '129', 'Name': "قانون", 'NameAr': "قانون" },
    { 'id': '130', 'Name': "كليات الفنون الحرة", 'NameAr': "كليات الفنون الحرة" },
    { 'id': '131', 'Name': "كورسات مهنية", 'NameAr': "كورسات مهنية" },
    { 'id': '132', 'Name': "ليسانس الآداب في الإدارة العامة", 'NameAr': "ليسانس الآداب في الإدارة العامة" },
    { 'id': '133', 'Name': "ماجستير الإحصاء التطبيقي", 'NameAr': "ماجستير الإحصاء التطبيقي" },
    { 'id': '134', 'Name': "ماجستير الآداب في الدراسات الإسلامية تخصص الفقه المعاصر", 'NameAr': "ماجستير الآداب في الدراسات الإسلامية تخصص الفقه المعاصر" },
    { 'id': '135', 'Name': "ماجستير الآداب في الدراسات الإسلامية تخصص مقارنة الأديان", 'NameAr': "ماجستير الآداب في الدراسات الإسلامية تخصص مقارنة الأديان" },
    { 'id': '136', 'Name': "ماجستير الآداب في السياسة العامة في الإسلام", 'NameAr': "ماجستير الآداب في السياسة العامة في الإسلام" },
    { 'id': '137', 'Name': "ماجستير الآداب في الفكر الإسلامي والمجتمعات المسلمة المعاصرة", 'NameAr': "ماجستير الآداب في الفكر الإسلامي والمجتمعات المسلمة المعاصرة" },
    { 'id': '138', 'Name': "ماجستير الآداب في اللغة العربية وآدابها", 'NameAr': "ماجستير الآداب في اللغة العربية وآدابها" },
    { 'id': '139', 'Name': "ماجستير الآداب في المناهج الدراسية والتدريس والتقييم", 'NameAr': "ماجستير الآداب في المناهج الدراسية والتدريس والتقييم" },
    { 'id': '140', 'Name': "ماجستير الآداب في دراسات الخليج", 'NameAr': "ماجستير الآداب في دراسات الخليج" },
    { 'id': '141', 'Name': "ماجستير التربية في التربية الخاصة", 'NameAr': "ماجستير التربية في التربية الخاصة" },
    { 'id': '142', 'Name': "ماجستير التربية في القيادة التربوية", 'NameAr': "ماجستير التربية في القيادة التربوية" },
    { 'id': '143', 'Name': "ماجستير التسويق", 'NameAr': "ماجستير التسويق" },
    { 'id': '144', 'Name': "ماجستير الصحة العامة", 'NameAr': "ماجستير الصحة العامة" },
    { 'id': '145', 'Name': "ماجستير العلوم في الإدارة الهندسية", 'NameAr': "ماجستير العلوم في الإدارة الهندسية" },
    { 'id': '146', 'Name': "ماجستير العلوم في التمويل الإسلامي", 'NameAr': "ماجستير العلوم في التمويل الإسلامي" },
    { 'id': '147', 'Name': "ماجستير العلوم في الحوسبة", 'NameAr': "ماجستير العلوم في الحوسبة" },
    { 'id': '148', 'Name': "ماجستير العلوم في العلوم البيئية", 'NameAr': "ماجستير العلوم في العلوم البيئية" },
    { 'id': '149', 'Name': "ماجستير العلوم في العلوم الحيوية الطبية", 'NameAr': "ماجستير العلوم في العلوم الحيوية الطبية" },
    { 'id': '150', 'Name': "ماجستير العلوم في الهندسة البيئية", 'NameAr': "ماجستير العلوم في الهندسة البيئية" },
    { 'id': '151', 'Name': "ماجستير العلوم في الهندسة الكهربائية", 'NameAr': "ماجستير العلوم في الهندسة الكهربائية" },
    { 'id': '152', 'Name': "ماجستير العلوم في الهندسة المدنية", 'NameAr': "ماجستير العلوم في الهندسة المدنية" },
    { 'id': '153', 'Name': "ماجستير العلوم في الهندسة الميكانيكية", 'NameAr': "ماجستير العلوم في الهندسة الميكانيكية" },
    { 'id': '154', 'Name': "ماجستير المحاسبة", 'NameAr': "ماجستير المحاسبة" },
    { 'id': '155', 'Name': "ماجستير إدارة الأعمال", 'NameAr': "ماجستير إدارة الأعمال" },
    { 'id': '156', 'Name': "ماجستير علوم المواد والتكنولوجيا", 'NameAr': "ماجستير علوم المواد والتكنولوجيا" },
    { 'id': '157', 'Name': "ماجستير في التصميم الحضري والعمارة في المجتمعات الإسلامية", 'NameAr': "ماجستير في التصميم الحضري والعمارة في المجتمعات الإسلامية" },
    { 'id': '158', 'Name': "مدارس إدارة الأعمال", 'NameAr': "مدارس إدارة الأعمال" },
    { 'id': '159', 'Name': "مسار - الأعمال", 'NameAr': "مسار - الأعمال" },
    { 'id': '160', 'Name': "مشارك في العلوم", 'NameAr': "مشارك في العلوم" },
    { 'id': '161', 'Name': "مشارك في العلوم التطبيقية في إدارة الجمارك", 'NameAr': "مشارك في العلوم التطبيقية في إدارة الجمارك" },
    { 'id': '162', 'Name': "مشارك في العلوم التطبيقية في إدارة المعلومات الصحية", 'NameAr': "مشارك في العلوم التطبيقية في إدارة المعلومات الصحية" },
    { 'id': '163', 'Name': "مشارك في الفنون", 'NameAr': "مشارك في الفنون" },
    { 'id': '164', 'Name': "مشارك في الفنون - مسار اللغة العربية", 'NameAr': "مشارك في الفنون - مسار اللغة العربية" },
    { 'id': '165', 'Name': "مشارك في الفنون في الإدارة العامة", 'NameAr': "مشارك في الفنون في الإدارة العامة" },
    { 'id': '166', 'Name': "نظم معلومات الأجهزة", 'NameAr': "نظم معلومات الأجهزة" },
    { 'id': '167', 'Name': "نظم معلومات الحاسوب", 'NameAr': "نظم معلومات الحاسوب" },
    { 'id': '168', 'Name': "هندسة البترول", 'NameAr': "هندسة البترول" },
    { 'id': '169', 'Name': "هندسة الحاسب", 'NameAr': "هندسة الحاسب" },
    { 'id': '170', 'Name': "هندسة الحاسوب", 'NameAr': "هندسة الحاسوب" },
    { 'id': '171', 'Name': "هندسة الكمبيوتر، عامة", 'NameAr': "هندسة الكمبيوتر، عامة" },
    { 'id': '172', 'Name': "هندسة إلكترونيات المطار", 'NameAr': "هندسة إلكترونيات المطار" },
    { 'id': '181', 'Name': "ادارة الامن", 'NameAr': "ادارة الامن" },
    { 'id': '201', 'Name': "طيار", 'NameAr': "طيار" },
    { 'id': '202', 'Name': "تربية بدنية وعلوم رياضية", 'NameAr': "تربية بدنية وعلوم رياضية" },
    { 'id': '203', 'Name': "إدارة لوجستيات التجارة والنقل الدولي", 'NameAr': "إدارة لوجستيات التجارة والنقل الدولي" },
    { 'id': '221', 'Name': "إدارة الاعمال والاستثمار", 'NameAr': "إدارة الاعمال والاستثمار" },
    { 'id': '222', 'Name': "الدبلوم المشارك في الأداب", 'NameAr': "الدبلوم المشارك في الأداب" },
    { 'id': '241', 'Name': "السياحة", 'NameAr': "السياحة" },
    { 'id': '261', 'Name': "هندسة طائرات", 'NameAr': "هندسة طائرات" },
    { 'id': '262', 'Name': "هندسة هليكوبتر", 'NameAr': "هندسة هليكوبتر" },
    { 'id': '263', 'Name': "إدارة وعلوم الإطفاء", 'NameAr': "إدارة وعلوم الإطفاء" },
    { 'id': '264', 'Name': "إدارة موانئ", 'NameAr': "إدارة موانئ" },
    { 'id': '265', 'Name': "هندسة إطفاء", 'NameAr': "هندسة إطفاء" },
    { 'id': '266', 'Name': "ماجستيرفي إدارةوحدة الأعمال الإستراتجية", 'NameAr': "ماجستيرفي إدارةوحدة الأعمال الإستراتجية" },
    { 'id': '281', 'Name': "دبلوم كترونيات الطيران", 'NameAr': "دبلوم كترونيات الطيران" },
    { 'id': '282', 'Name': "هندسة كيميائية", 'NameAr': "هندسة كيميائية" },
    { 'id': '283', 'Name': "البكالوريوس في الاداب", 'NameAr': "البكالوريوس في الاداب" },
    { 'id': '284', 'Name': "دبلوم الكترونيات الطيران", 'NameAr': "دبلوم الكترونيات الطيران" },
    { 'id': '301', 'Name': "تكنولوجيا هندسة الإتصالات", 'NameAr': "تكنولوجيا هندسة الإتصالات" },
    { 'id': '321', 'Name': "الآداب في العلاقات العامة", 'NameAr': "الآداب في العلاقات العامة" },
    { 'id': '322', 'Name': "نظم المعلومات الادارية", 'NameAr': "نظم المعلومات الادارية" },
    { 'id': '323', 'Name': "تكنولوجيا التشييد", 'NameAr': "تكنولوجيا التشييد" },
    { 'id': '324', 'Name': "علم المعلومات والمكتبات", 'NameAr': "علم المعلومات والمكتبات" },
    { 'id': '325', 'Name': "إدارة الطيران", 'NameAr': "إدارة الطيران" },
    { 'id': '326', 'Name': "ماجستير إدارة الاعمال", 'NameAr': "ماجستير إدارة الاعمال" },
    { 'id': '327', 'Name': "إدارة المكاتب", 'NameAr': "إدارة المكاتب" },
    { 'id': '328', 'Name': "جغرافيا / تخطيط عمراني", 'NameAr': "جغرافيا / تخطيط عمراني" },
    { 'id': '329', 'Name': "ماجستير إدارة استراتيجية", 'NameAr': "ماجستير إدارة استراتيجية" },
    { 'id': '341', 'Name': "ماجستير الإدارة", 'NameAr': "ماجستير الإدارة" },
    { 'id': '342', 'Name': "تكنولوجيا المعلومات والاتصالات", 'NameAr': "تكنولوجيا المعلومات والاتصالات" },
    { 'id': '343', 'Name': "طب بشري", 'NameAr': "طب بشري" },
    { 'id': '344', 'Name': "هندسة البرمجيات", 'NameAr': "هندسة البرمجيات" },
    { 'id': '361', 'Name': "إدارة فنادق", 'NameAr': "إدارة فنادق" },
    { 'id': '381', 'Name': "طب جراحة الفم والاسنان", 'NameAr': "طب جراحة الفم والاسنان" },
    { 'id': '382', 'Name': "تكنولوجيا المعلومات التجارية", 'NameAr': "تكنولوجيا المعلومات التجارية" },
    { 'id': '383', 'Name': "طب وجراحة", 'NameAr': "طب وجراحة" },
    { 'id': '384', 'Name': "التصوير الشعاعي الطبي", 'NameAr': "التصوير الشعاعي الطبي" },
    { 'id': '385', 'Name': "هندسة بحرية", 'NameAr': "هندسة بحرية" },
    { 'id': '386', 'Name': "العلوم الزراعية", 'NameAr': "العلوم الزراعية" },
    { 'id': '387', 'Name': "اصول دين", 'NameAr': "اصول دين" },
    { 'id': '401', 'Name': "هندسة مناجم", 'NameAr': "هندسة مناجم" },
    { 'id': '421', 'Name': "ادارة انشاءات", 'NameAr': "ادارة انشاءات" },
    { 'id': '441', 'Name': "تكنولوجيا البترول", 'NameAr': "تكنولوجيا البترول" },
    { 'id': '442', 'Name': "تكنولوجيا معلومات الحاسب", 'NameAr': "تكنولوجيا معلومات الحاسب" },
    { 'id': '461', 'Name': "الهندسة الالكترونية والكمبيوتر", 'NameAr': "الهندسة الالكترونية والكمبيوتر" },
    { 'id': '462', 'Name': "دراسات مالية ومصرفية", 'NameAr': "دراسات مالية ومصرفية" },
    { 'id': '463', 'Name': "بكالوريوس / التعليم الثانوي", 'NameAr': "بكالوريوس / التعليم الثانوي" },
    { 'id': '464', 'Name': "إدارة الرعاية الصحية", 'NameAr': "إدارة الرعاية الصحية" },
    { 'id': '465', 'Name': "القضاء", 'NameAr': "القضاء" },
    { 'id': '466', 'Name': "علم الاسعافات", 'NameAr': "علم الاسعافات" },
    { 'id': '467', 'Name': "اتصالات لاسلكية", 'NameAr': "اتصالات لاسلكية" },
    { 'id': '468', 'Name': "مراقبة الطرق", 'NameAr': "مراقبة الطرق" },
    { 'id': '469', 'Name': "قانون الادارة العمومية", 'NameAr': "قانون الادارة العمومية" },
    { 'id': '481', 'Name': "علم الانسان", 'NameAr': "علم الانسان" },
    { 'id': '501', 'Name': "دبلوم في عمليات المطارات المتقدمة", 'NameAr': "دبلوم في عمليات المطارات المتقدمة" },
    { 'id': '521', 'Name': "مختبرات كيميائية", 'NameAr': "مختبرات كيميائية" },
    { 'id': '522', 'Name': "الماجستير في الفقة المقارن", 'NameAr': "الماجستير في الفقة المقارن" },
    { 'id': '523', 'Name': "دكتواره في الفقه واصوله", 'NameAr': "دكتواره في الفقه واصوله" },
    { 'id': '541', 'Name': "الاكاديمية العربية للعلوم المالية والمصرفية", 'NameAr': "الاكاديمية العربية للعلوم المالية والمصرفية" },
    { 'id': '542', 'Name': "ميكانيك مركبات", 'NameAr': "ميكانيك مركبات" },
    { 'id': '543', 'Name': "هندسة الانظمة", 'NameAr': "هندسة الانظمة" },
    { 'id': '561', 'Name': "ادارة مالية ومصرفية", 'NameAr': "ادارة مالية ومصرفية" },
    { 'id': '581', 'Name': "المسح الكمي", 'NameAr': "المسح الكمي" },
    { 'id': '582', 'Name': "الدبلوم المشارك في العلوم", 'NameAr': "الدبلوم المشارك في العلوم" },
    { 'id': '601', 'Name': "فني تقني", 'NameAr': "فني تقني" },
    { 'id': '602', 'Name': "تكنولوجيا الالات او الاجهزه", 'NameAr': "تكنولوجيا الالات او الاجهزه" },
    { 'id': '603', 'Name': "اشعه طبيه", 'NameAr': "اشعه طبيه" },
    { 'id': '604', 'Name': "التحول الاجتماعي", 'NameAr': "التحول الاجتماعي" },
    { 'id': '605', 'Name': "حقوق", 'NameAr': "حقوق" },
    { 'id': '606', 'Name': "علاقات دوليه", 'NameAr': "علاقات دوليه" },
    { 'id': '607', 'Name': "موارد بشريه", 'NameAr': "موارد بشريه" },
    { 'id': '608', 'Name': "العلوم السياسيه", 'NameAr': "العلوم السياسيه" },
    { 'id': '609', 'Name': "هندسه اتصالات", 'NameAr': "هندسه اتصالات" },
    { 'id': '610', 'Name': "هندسه مواد", 'NameAr': "هندسه مواد" },
    { 'id': '611', 'Name': "الماجستير في ادارة تكنولوجيا المعلومات", 'NameAr': "الماجستير في ادارة تكنولوجيا المعلومات" },
    { 'id': '612', 'Name': "هندسه ميكانيكيه", 'NameAr': "هندسه ميكانيكيه" },
    { 'id': '613', 'Name': "ماجستير الدراسات الاسلاميه فقه معاصر", 'NameAr': "ماجستير الدراسات الاسلاميه فقه معاصر" },
    { 'id': '621', 'Name': "ادارة اعمال جمركيه", 'NameAr': "ادارة اعمال جمركيه" },
    { 'id': '622', 'Name': "اداره انظمه الكمبيوتر", 'NameAr': "اداره انظمه الكمبيوتر" },
    { 'id': '623', 'Name': "ماجستير في الادارة الهندسيه", 'NameAr': "ماجستير في الادارة الهندسيه" },
    { 'id': '641', 'Name': "تكنولوجيا فيلم", 'NameAr': "تكنولوجيا فيلم" },
    { 'id': '643', 'Name': "الانترنت مطور التطبيق", 'NameAr': "الانترنت مطور التطبيق" },
    { 'id': '644', 'Name': "دبلوم تقنية المعلومات", 'NameAr': "دبلوم تقنية المعلومات" },
    { 'id': '646', 'Name': "مشغل فني", 'NameAr': "مشغل فني" },
    { 'id': '647', 'Name': "الاتصال", 'NameAr': "الاتصال" },
    { 'id': '648', 'Name': "دبلوم فنى كيميائى", 'NameAr': "دبلوم فنى كيميائى" },
    { 'id': '649', 'Name': "ماجستير في هندسة البترول", 'NameAr': "ماجستير في هندسة البترول" },
    { 'id': '661', 'Name': "ماجستير في التمويل", 'NameAr': "ماجستير في التمويل" },
    { 'id': '662', 'Name': "دبلوم التكنولوجي", 'NameAr': "دبلوم التكنولوجي" },
    { 'id': '663', 'Name': "اللغات", 'NameAr': "اللغات" },
    { 'id': '665', 'Name': "تكنولوجيا الهندسه", 'NameAr': "تكنولوجيا الهندسه" },
    { 'id': '681', 'Name': "هندسه الالات الدقيقه", 'NameAr': "هندسه الالات الدقيقه" },
    { 'id': '682', 'Name': "العلوم", 'NameAr': "العلوم" },
    { 'id': '701', 'Name': "ادارة انشطة دولية", 'NameAr': "ادارة انشطة دولية" },
    { 'id': '721', 'Name': "علم الاحياء", 'NameAr': "علم الاحياء" },
    { 'id': '741', 'Name': "تقنيه الشبكات", 'NameAr': "تقنيه الشبكات" },
    { 'id': '761', 'Name': "نظم المعلومات الجغرافيه", 'NameAr': "نظم المعلومات الجغرافيه" },
    { 'id': '762', 'Name': "الدراسات البحريه", 'NameAr': "الدراسات البحريه" },
    { 'id': '763', 'Name': "الهندسه البيئيه", 'NameAr': "الهندسه البيئيه" },
    { 'id': '764', 'Name': "الهندسه الكهروميكانيكا", 'NameAr': "الهندسه الكهروميكانيكا" },
    { 'id': '765', 'Name': "اداره واقتصاد البترول", 'NameAr': "اداره واقتصاد البترول" },
    { 'id': '766', 'Name': "الملاحه البحريه", 'NameAr': "الملاحه البحريه" },
    { 'id': '767', 'Name': "هندسه التصنيع", 'NameAr': "هندسه التصنيع" },
    { 'id': '769', 'Name': "هندسه القياس والتحكم", 'NameAr': "هندسه القياس والتحكم" },
    { 'id': '770', 'Name': "علم الجريمه", 'NameAr': "علم الجريمه" },
    { 'id': '781', 'Name': "العلاقات العامه والإعلان", 'NameAr': "العلاقات العامه والإعلان" },
    { 'id': '801', 'Name': "ماجستير اداره وتخطيط", 'NameAr': "ماجستير اداره وتخطيط" },
    { 'id': '821', 'Name': "الجيولوجيا - علم الأرض", 'NameAr': "الجيولوجيا - علم الأرض" },
    { 'id': '841', 'Name': "هندسه تكنولوجيا المعلومات", 'NameAr': "هندسه تكنولوجيا المعلومات" },
    { 'id': '861', 'Name': "بكالوريوس الهندسه المدنية", 'NameAr': "بكالوريوس الهندسه المدنية" },
    { 'id': '881', 'Name': "ماجستير في العقارات", 'NameAr': "ماجستير في العقارات" },
    { 'id': '901', 'Name': "الهندسه في القياس والتحكم", 'NameAr': "الهندسه في القياس والتحكم" },
    { 'id': '921', 'Name': "ادارة تسيير المشاريع", 'NameAr': "ادارة تسيير المشاريع" },
    { 'id': '941', 'Name': "ادارة واقتصاد", 'NameAr': "ادارة واقتصاد" },
    { 'id': '942', 'Name': "علم الحديث", 'NameAr': "علم الحديث" },
    { 'id': '961', 'Name': "هندسه نوويه", 'NameAr': "هندسه نوويه" },
    { 'id': '962', 'Name': "الفلسفه الرئيسيه", 'NameAr': "الفلسفه الرئيسيه" },
    { 'id': '981', 'Name': "ماجستير في العلوم", 'NameAr': "ماجستير في العلوم" },
    { 'id': '982', 'Name': "تنمية  مهارات المفتشين  البيئين", 'NameAr': "تنمية  مهارات المفتشين  البيئين" },
    { 'id': '984', 'Name': "الادارة والقياده", 'NameAr': "الادارة والقياده" },
    { 'id': '985', 'Name': "هندسه طيران", 'NameAr': "هندسه طيران" },
    { 'id': '986', 'Name': "الاداره الماليه والمحاسبه", 'NameAr': "الاداره الماليه والمحاسبه" },
    { 'id': '1001', 'Name': "الحوسبه التطبيقيه", 'NameAr': "الحوسبه التطبيقيه" },
    { 'id': '1021', 'Name': "هندسه التعدين", 'NameAr': "هندسه التعدين" },
    { 'id': '1041', 'Name': "مشغل عمليات كيميائي", 'NameAr': "مشغل عمليات كيميائي" },
    { 'id': '1042', 'Name': "كهربائي تمديدات كهربائيه", 'NameAr': "كهربائي تمديدات كهربائيه" },
    { 'id': '1061', 'Name': "اعلاميه التصرف", 'NameAr': "اعلاميه التصرف" },
    { 'id': '1062', 'Name': "ادب امريكي", 'NameAr': "ادب امريكي" },
    { 'id': '1081', 'Name': "الشريعه", 'NameAr': "الشريعه" },
    { 'id': '1101', 'Name': "الاعمال الالكترونيه العالميه", 'NameAr': "الاعمال الالكترونيه العالميه" },
    { 'id': '1121', 'Name': "الهندسه الالكترونيه", 'NameAr': "الهندسه الالكترونيه" },
    { 'id': '1141', 'Name': "دراسات دبلوماسيه", 'NameAr': "دراسات دبلوماسيه" },
    { 'id': '1161', 'Name': "ماجستير الموارد البشرية", 'NameAr': "ماجستير الموارد البشرية" },
    { 'id': '1162', 'Name': "إخراج سينمائي", 'NameAr': "إخراج سينمائي" },
    { 'id': '1181', 'Name': "هندسة طرق", 'NameAr': "هندسة طرق" },
    { 'id': '1201', 'Name': "إدارة كوارث", 'NameAr': "إدارة كوارث" },
    { 'id': '1221', 'Name': "الأمن السيبراتي وأمن الشبكات", 'NameAr': "الأمن السيبراتي وأمن الشبكات" }
]

var data_Ministry = [
    { 'id': '', 'Name': DBSTRING['PleaseSelect'], 'NameAr': DBSTRING['PleaseSelect'] },
    { 'id': '1', 'Name': "وزاره العمل", 'NameAr': "وزاره العمل" },
    { 'id': '2', 'Name': 'وزاره الصحه', 'NameAr': 'وزاره الصحه' },
    { 'id': '3', 'Name': 'وزاره التربيه والتعليم', 'NameAr': 'وزاره التربيه والتعليم' },
    { 'id': '4', 'Name': 'وزاره الدفاع', 'NameAr': 'وزاره الدفاع' },
    { 'id': '5', 'Name': 'وزاره الداخليه', 'NameAr': 'وزاره الداخليه' },
    { 'id': '6', 'Name': 'وزاره التعليم العالي', 'NameAr': 'وزاره التعليم العالي' },
    { 'id': '7', 'Name': 'وزاره التخطيط', 'NameAr': 'وزاره التخطيط' },
    { 'id': '8', 'Name': 'وزاره الطاقه', 'NameAr': 'وزاره الطاقه' },
];



var data_ManagementAction = [
    { 'id': '', 'Name': DBSTRING['PleaseSelect'], 'NameAr': DBSTRING['PleaseSelect'] },
    { 'id': '4', 'Name': DBSTRING['Approved'], 'NameAr': DBSTRING['Approved'] },
    { 'id': '6', 'Name': DBSTRING['Reject'], 'NameAr': DBSTRING['Reject'] }
];

var data_UniversitySocialStatus = [
    { 'id': '', 'Name': DBSTRING['PleaseSelect'], 'NameAr': DBSTRING['PleaseSelect'] },
    { 'id': '1', 'Name': DBSTRING['single'], 'NameAr': DBSTRING['single'] },
    { 'id': '2', 'Name': DBSTRING['Married'], 'NameAr': DBSTRING['Married'] },
    { 'id': '3', 'Name': DBSTRING['Defors'], 'NameAr': DBSTRING['Defors'] },
    { 'id': '4', 'Name': DBSTRING['wiedow'], 'NameAr': DBSTRING['wiedow'] }
];




var data_Jobs = [
    { 'id': '', 'Name': DBSTRING['PleaseSelect'], 'NameAr': DBSTRING['PleaseSelect'] },
    { 'id': '1', 'Name': DBSTRING['Employee'], 'NameAr': DBSTRING['Employee'] },
    { 'id': '2', 'Name': DBSTRING['UnEmployee'], 'NameAr': DBSTRING['UnEmployee'] }
];



var data_UniversityBloodType = [
    { 'id': '', 'Name': DBSTRING['PleaseSelect'], 'NameAr': DBSTRING['PleaseSelect'] },
    { 'id': '1', 'Name': '+O', 'NameAr': '+O' },
    { 'id': '2', 'Name': '-O', 'NameAr': '-O' },
    { 'id': '3', 'Name': '+A', 'NameAr': '+A' },
    { 'id': '4', 'Name': '-A', 'NameAr': '-A' },
    { 'id': '5', 'Name': '+B', 'NameAr': '+B' },
    { 'id': '6', 'Name': '-B', 'NameAr': '-B' },
    { 'id': '7', 'Name': '+AB', 'NameAr': '+AB' },
    { 'id': '8', 'Name': '-AB', 'NameAr': '-AB' },
];




var data_Reasons_Postponement_Exemption_Requirements = [
    { 'id': '', 'Name': DBSTRING['PleaseSelect'], 'NameAr': DBSTRING['PleaseSelect'] },
    { 'id': '1', 'Name': "غير لايق صحيا", 'NameAr': "غير لايق صحيا" },
    { 'id': '2', 'Name': 'العائل من أبناء العسكريين', 'NameAr': 'العائل من أبناء العسكريين' },
    { 'id': '3', 'Name': 'العائل من أبناء المجند', 'NameAr': 'العائل من أبناء المجند' },
    { 'id': '4', 'Name': 'العائل من أبناء الشهيد', 'NameAr': 'العائل من أبناء الشهيد' },
    { 'id': '5', 'Name': 'العائل  من أبناء المفقود الذى قضى بوفاتة حكماَ', 'NameAr': 'العائل  من أبناء المفقود الذى قضى بوفاتة حكماَ' },
    { 'id': '6', 'Name': "الاعتبارات الإنسانية", 'NameAr': "الاعتبارات الإنسانية" },
    { 'id': '7', 'Name': "للمصلحة العامة", 'NameAr': "للمصلحة العامة" },
    { 'id': '8', 'Name': "عسكرى على راس عملة", 'NameAr': "عسكرى على راس عملة" },
    { 'id': '9', 'Name': "عسكرى سابق", 'NameAr': "عسكرى سابق" },
    { 'id': '10', 'Name': "مستثنى على راس عملة", 'NameAr': "مستثنى على راس عملة" },
    { 'id': '11', 'Name': "مستثنى عسكرى سابق", 'NameAr': "مستثنى عسكرى سابق" },
    { 'id': '12', 'Name': "متوفى", 'NameAr': "متوفى", },
    { 'id': '13', 'Name': "طالب في احدى الكليات او المعاهد او المدارس العسكرية", 'NameAr': "طالب في احدى الكليات او المعاهد او المدارس العسكرية" },
    { 'id': '14', 'Name': "طالب في احدى الكليات او المعاهد او المدارس العسكرية سابقا", 'NameAr': "طالب في احدى الكليات او المعاهد او المدارس العسكرية سابقا" },
    { 'id': '15', 'Name': "غير لايق صحيا(موقت)", 'NameAr': "غير لايق صحيا(موقت)" },
    { 'id': '16', 'Name': "العائل الوحيد لاخوته او لاخواتة العاجزين", 'NameAr': "العائل الوحيد لاخوته او لاخواتة العاجزين" },
    { 'id': '17', 'Name': "العائل الوحيد لاخواتة الذين لم يتمو سن الثامنة عشرة", 'NameAr': "العائل الوحيد لاخواتة الذين لم يتمو سن الثامنة عشرة" },
    { 'id': '18', 'Name': "العائل الوحيد لأمه", 'NameAr': "العائل الوحيد لأمه" },
    { 'id': '19', 'Name': "العائل الوحيد لأبوية او لأبية", 'NameAr': "العائل الوحيد لأبوية او لأبية" },
    { 'id': '20', 'Name': "العائل الوحيد لاخواتة الغير متزوجات", 'NameAr': "العائل الوحيد لاخواتة الغير متزوجات" },
    { 'id': '21', 'Name': "العائل من أبناء الأسير", 'NameAr': "العائل من أبناء الأسير" },
    { 'id': '22', 'Name': "العائل من أبناء المفقود", 'NameAr': "العائل من أبناء المفقود" },
    { 'id': '23', 'Name': "الابن الوحيد لابوين", 'NameAr': "الابن الوحيد لابوين" },
    { 'id': '24', 'Name': "الابن الوحيد لام", 'NameAr': "الابن الوحيد لام" },
    { 'id': '25', 'Name': "وحد الولدين لاب", 'NameAr': "وحد الولدين لاب" },
    { 'id': '26', 'Name': "وحدالولدين لام", 'NameAr': "وحدالولدين لام" },
    { 'id': '27', 'Name': "يعتبر في حكم الابن الوحيد", 'NameAr': "يعتبر في حكم الابن الوحيد" },
    { 'id': '28', 'Name': "من توفت زوجتة الوحيده ولدية أبناء قصر", 'NameAr': "من توفت زوجتة الوحيده ولدية أبناء قصر" },
    { 'id': '29', 'Name': "محكوم عليه بعقوبة سالبة للحرية", 'NameAr': "محكوم عليه بعقوبة سالبة للحرية" },
    { 'id': '30', 'Name': "محبوس احتياطياَ", 'NameAr': "محبوس احتياطياَ" },
    { 'id': '31', 'Name': "طالب في الثانوية او مايعادلها", 'NameAr': "طالب في الثانوية او مايعادلها" },
    { 'id': '32', 'Name': "مبتعث ضمن برنامج البعثة الاميرية", 'NameAr': "مبتعث ضمن برنامج البعثة الاميرية" },
    { 'id': '33', 'Name': "مقبول للدراسة في احدى كليات الطب المعتمدة لدى وزارة التعليم والتعليم العالى(قبول غير مشروط)", 'NameAr': "مقبول للدراسة في احدى كليات الطب المعتمدة لدى وزارة التعليم والتعليم العالى(قبول غير مشروط)" },
    { 'id': '34', 'Name': "طالب في احدى كليات الطب المعتمدة لدى وزارة التعليم والتعليم العالى(قبول غير مشروط)", 'NameAr': "طالب في احدى كليات الطب المعتمدة لدى وزارة التعليم والتعليم العالى(قبول غير مشروط)" },
    { 'id': '35', 'Name': "ملتحق بالدراسة في احدى كليات دون المستوى الجامعى قبل سريان اجكام القانون", 'NameAr': "ملتحق بالدراسة في احدى كليات دون المستوى الجامعى قبل سريان اجكام القانون" },
    { 'id': '36', 'Name': "ملتحق بالدراسة في احدى الجامعات او المعاهد العليا قبل سريان   اجكام القانون", 'NameAr': "ملتحق بالدراسة في احدى الجامعات او المعاهد العليا قبل سريان   اجكام القانون" },
    { 'id': '37', 'Name': "خريج تقضى طبيعة دراسة قضاء فترة تدريبية بعد الحصول على المؤهل", 'NameAr': "خريج تقضى طبيعة دراسة قضاء فترة تدريبية بعد الحصول على المؤهل" },
    { 'id': '38', 'Name': "مرافق لزوجتة للعمل في الخارج", 'NameAr': "مرافق لزوجتة للعمل في الخارج" },
    { 'id': '39', 'Name': "مرافق لزوجتة للدراسة في الخارج", 'NameAr': "مرافق لزوجتة للدراسة في الخارج" },
    { 'id': '40', 'Name': "مرافق لزوجتة للعلاج في الخارج", 'NameAr': "مرافق لزوجتة للعلاج في الخارج" },
    { 'id': '41', 'Name': "مرافق لاحد اقاربة للعمل في الخارج", 'NameAr': "مرافق لاحد اقاربة للعمل في الخارج" },
    { 'id': '42', 'Name': "مرافق لاحد اقاربة  للدراسة في الخارج", 'NameAr': "مرافق لاحد اقاربة  للدراسة في الخارج" },
    { 'id': '43', 'Name': "مرافق لاحد اقاربة للعلاج في الخارج", 'NameAr': "مرافق لاحد اقاربة للعلاج في الخارج" },
    { 'id': '44', 'Name': "مرشح للتعين لدى إحدى الجهات العسكرية", 'NameAr': "مرشح للتعين لدى إحدى الجهات العسكرية" },
    { 'id': '45', 'Name': "اسباب اخرى", 'NameAr': "اسباب اخرى" },
];





function fill_Ministry() {


    var Lang = sessionStorage['lang'];

    var DataSource_Ministry = new kendo.data.DataSource({ data: data_Ministry });

    $("#Ministry").kendoDropDownList({
        dataTextField: Lang === 'ar' ? "NameAr" : "Name",
        dataValueField: "id",
        template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
        dataSource: DataSource_Ministry,
        filter: "contains",
        suggest: true



    });
}


function fill_UniversitySpecialization() {


    var Lang = sessionStorage['lang'];

    var DataSource_UniversitySpecialization = new kendo.data.DataSource({ data: data_UniversitySpecialization });

    $("#UniversitySpecialization").kendoDropDownList({
        dataTextField: Lang === 'ar' ? "NameAr" : "Name",
        dataValueField: "id",
        template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
        dataSource: DataSource_UniversitySpecialization,
        filter: "contains",
        suggest: true



    });
}



function fill_county() {


    var Lang = sessionStorage['lang'];

    var DataSource_county = new kendo.data.DataSource({ data: data_county });

    $("#UniversityLocation").kendoDropDownList({
        dataTextField: Lang === 'ar' ? "NameAr" : "Name",
        dataValueField: "id",
        template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
        dataSource: DataSource_county,
        filter: "contains",
        suggest: true



    });
}




 


function fill_ManagementAction() {


    var Lang = sessionStorage['lang'];

    var DataSource_ManagementAction = new kendo.data.DataSource({ data: data_ManagementAction });

    $("#ManagementAction").kendoDropDownList({
        dataTextField: Lang === 'ar' ? "NameAr" : "Name",
        dataValueField: "id",
        template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
        dataSource: DataSource_ManagementAction,
        filter: "contains",
        suggest: true



    });
}


function Fill_UniversitySocialStatus() {

    var Lang = sessionStorage['lang'];

    var DataSource_UniversitySocialStatus = new kendo.data.DataSource({ data: data_UniversitySocialStatus });
    try {


        $("#UniversitySocialStatus").kendoDropDownList({
            dataTextField: Lang === 'ar' ? "NameAr" : "Name",
            dataValueField: "id",
            template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
            dataSource: DataSource_UniversitySocialStatus,
            filter: "contains",
            suggest: true,
            index: 3


        });

    } catch (e) {
        alert(e);
    }




}

function Fill_Jobs() {


    var Lang = sessionStorage['lang'];
    var DataSource_Jobs = new kendo.data.DataSource({ data: data_Jobs });

    $("#IsEmployee").kendoDropDownList({
        dataTextField: Lang === 'ar' ? "NameAr" : "Name",
        dataValueField: "id",
        template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
        dataSource: DataSource_Jobs,
        change: dropdownlist_changeJobs,
        filter: "contains",
        suggest: true


    });

    var dropdownlist_Jobs = $("#IsEmployee").data("kendoDropDownList");
    dropdownlist_Jobs.select(0);


}


function Fill_UniversityBloodType() {



    var Lang = sessionStorage['lang'];


    var DataSource_UniversityBloodType = new kendo.data.DataSource({ data: data_UniversityBloodType });

    $("#UniversityBloodType").kendoDropDownList({
        dataTextField: Lang === 'ar' ? "NameAr" : "Name",
        dataValueField: "id",
        template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
        dataSource: DataSource_UniversityBloodType,
        filter: "contains",
        suggest: true,
        index: 3

    });


}

function Fill_Reasons_Postponement_Exemption_Requirements() {





    var Lang = sessionStorage['lang'];


    var DataSource_Reasons_Postponement_Exemption_Requirements = new kendo.data.DataSource({ data: data_Reasons_Postponement_Exemption_Requirements });

    $("#University_Delay_Exemption_Exception").kendoDropDownList({
        dataTextField: Lang === 'ar' ? "NameAr" : "Name",
        dataValueField: "id",
        template: Lang === 'ar' ? '<i class="#:data.Flag # flag"></i> ' + '#:data.NameAr #' : '<i class="#:data.Flag # flag"></i> ' + '#:data.Name #',
        dataSource: DataSource_Reasons_Postponement_Exemption_Requirements,
        filter: "contains",
        suggest: true,
        change: dropdownlist_change,
        index: 3


    });



}

function setProgressBar(curStep) {
    var steps = $("fieldset").length;
    var percent = parseFloat(100 / steps) * curStep;
    percent = percent.toFixed();
    $(".progress-bar")
        .css("width", percent + "%")
}



var ValidatefieldsData = function ($form) {

    var noErrors = true;


    var fields = $('#fs_' + $form[0].id + " .is-required")
        .find("select, textarea, input");

    $.each(fields, function (i, field) {

        if (!field.value) {
            if ($(field).hasClass('k-input')) {
                if ($(field).parent()[0].innerText === '') {
                    noErrors = false;

                    markInvalid($(field), $(field).closest($inputWrapper).siblings($helperClass).attr('data-error'));

                    return noError;
                }
                else {
                    markValid($(field));
                }
            }
            else {
                noErrors = false;

                markInvalid($(field), $(field).closest($inputWrapper).siblings($helperClass).attr('data-error'));

                return noError;
            }

        }
        else {
            markValid($(field));
        }
    });

    noErrors = ValidateFormData('fs_' + $form[0].id);


    return noErrors;
}

function ready_Page() {








    $("#panelbar_Postponement_exemption").kendoPanelBar({
        expandMode: "multiple"
    });

    $("#panelbar_InfoWrokCurrent").kendoPanelBar({
        expandMode: "multiple"
    });


    var panelBar = $("#panelbar_InfoWrokCurrent").data("kendoPanelBar");
    // expand the element with ID, "item1"
    panelBar.expand($("#InfoWrokCurrentPanel"));




    if (sessionStorage['IsSuperAdmin'] != 'true') {


        document.getElementsByName("next1")[0].value = DBSTRING['Next'];
        document.getElementsByName("previous1")[0].value = DBSTRING['Previous'];

        document.getElementsByName("next2")[0].value = DBSTRING['Next'];
        document.getElementsByName("previous2")[0].value = DBSTRING['Previous'];

        document.getElementsByName("next3")[0].value = DBSTRING['Next'];
        document.getElementsByName("previous3")[0].value = DBSTRING['Previous'];

        document.getElementsByName("next4")[0].value = DBSTRING['Next'];
        document.getElementsByName("previous4")[0].value = DBSTRING['Previous'];

        document.getElementsByName("next5")[0].value = DBSTRING['Next'];
        document.getElementsByName("previous5")[0].value = DBSTRING['Previous'];


        document.getElementsByName("next6")[0].value = DBSTRING['Next'];
        document.getElementsByName("previous6")[0].value = DBSTRING['Previous'];
        document.getElementsByName("submit")[0].value = DBSTRING['submit'];





        setProgressBar(current);

        $(".next").click(function () {



            current_fs = $(this).parent();
            next_fs = $(this).parent().next();

            if (!ValidatefieldsData($("#progressbar li").eq($("fieldset").index(current_fs))))
                return false;

            if (current == 6 && $('#ImageName_Passport').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_Passport']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }

            if (current == 6 && $('#ImageName_QID').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_QID']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }

            if (current == 6 && $('#ImageName_person').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_person']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }

            if (current == 6 && $('#ImageName_Certificates').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_CertificationUniversity']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }

            if (current == 6 && $('#ImageName_workletter_MinistryDevelopment').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_workletter_MinistryDevelopment']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }


             

            if (current == 6 && $('#ImageName_married').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_married']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }


            if (current == 6 && $('#ImageName_Health').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_Health']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }



            if (current == 6 && $('#ImageName_Transcript').val() == "") {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_Transcript']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }


            if (current == 7 && $('#IsAddDelay_Exemption_Exception').is(':checked') == true && ($('#University_Delay_Exemption_Exception').val() == '' || $('#ImageName_other').val() == '')) {

                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultTxt').html(DBSTRING['lblphotos_University_Delay_Exemption_Exception']);
                setTimeout("$('#ResultMessage').removeClass('show')", 2000);
                return false;
            }
            if (current == 7) {


                try {
                    SaveUniversity(this);
                } catch (e) {

                }
            } else {



                //Add Class Active
                $("#progressbar li").eq($("fieldset").index(next_fs)).addClass("active");

                //show the next fieldset
                next_fs.show();
                //hide the current fieldset with style
                current_fs.animate({ opacity: 0 }, {
                    step: function (now) {
                        // for making fielset appear animation
                        opacity = 1 - now;

                        current_fs.css({
                            'display': 'none',
                            'position': 'relative'
                        });
                        next_fs.css({ 'opacity': opacity });
                    },
                    duration: 300
                });
                setProgressBar(++current);

            }

        });

        $(".previous").click(function () {




            current_fs = $(this).parent();
            previous_fs = $(this).parent().prev();

            //Remove class active
            $("#progressbar li").eq($("fieldset").index(current_fs)).removeClass("active");

            //show the previous fieldset
            previous_fs.show();

            //hide the current fieldset with style
            current_fs.animate({ opacity: 0 }, {
                step: function (now) {
                    // for making fielset appear animation
                    opacity = 1 - now;

                    current_fs.css({
                        'display': 'none',
                        'position': 'relative'
                    });
                    previous_fs.css({ 'opacity': opacity });
                },
                duration: 300
            });
            setProgressBar(--current);
        });

        if ((CheckPageSoldier() == true || CheckPageSchool() == true)) {
            LoadContent('Dashboard');
            return false;
        }

        var Lang = sessionStorage['lang'];
        $folderImg = 'University';



        $("#UniversityBrithDayDate").kendoDatePicker({

        });




        Fill_UniversitySocialStatus()
        Fill_Jobs();
        Fill_UniversityBloodType();
        fill_Ministry();
        fill_UniversitySpecialization();
        fill_county();
        Fill_Reasons_Postponement_Exemption_Requirements();


        api_call();




        var MenuID = $('[actions="' + sessionStorage['lastPage'] + '"]').attr('id');
        var changeLogo = GetPermession(MenuID, 'changeLogo');
        var Edit = GetPermession(MenuID, 'edit');




        var Edit = GetPermession(MenuID, 'edit');
        if (!Edit) {
            $('#SaveUniversity').hide();
            $(':input, select ', '#UniversityForm').attr('disabled', true);
            DisabledEnableKendoDropDownByForm('UniversityForm', false)

            $('#photos_Passport').parent().hide();
            $('#delete-image-Passport').hide();

            $('#photos_QID').parent().hide();
            $('#delete-image-QID').hide();

            $('#photos_person').parent().hide();
            $('#delete-image-person').hide();

            $('#photos_Certificates').parent().hide();
            $('#delete-image-Certificates').hide();

            $('#photos_workletter_MinistryDevelopment').parent().hide();
            $('#delete-image-workletter_MinistryDevelopment').hide();

            $('#photos_married').parent().hide();
            $('#delete-image-married').hide();

            $('#photos_Health').parent().hide();
            $('#delete-image-Health').hide();



            $('#photos_Transcript').parent().hide();
            $('#delete-image-Transcript').hide();

            $('#photos_other').parent().hide();
            $('#delete-image-other').hide();
        }
    }





    BindFileUploaderkendoUniversity();
    FillDBSTRINGPage('UniversityForm');

}

$(document).ready(function () {

    ready_Page();
});







function FillLabel_lblphotos_University_Delay_Exemption_Exception(value) {
    switch (value) {
        case "1":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'قرار من اللجنة الطبية العسكرية';
            break;
        case "6" || "7":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'من عند الوزير او من يوفوضه';
            break;
        case "8":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهادة دورة تاسيسية + اثبات عمل';
            break;
        case "9":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهادة دورة تاسيسية + اخلاء طرف من الجهة العسكرية موضح عدد سنوات الخدمة';
            break;
        case "10":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهادة دورة تاسيسية + اثبات عمل ';
            break;
        case "11":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهادة دورة تاسيسية + اخلاء طرف من الجهة العسكرية موضح عدد سنوات الخدمة';
            break;
        case "12":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهادة وفاه من وزارة الصحة';
            break;
        case "13":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'موافقه او صلاحية تجنيد من الوزير او الجهه العسكرية';
            break;
        case "14":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهادة دورة تاسيسية + اخلاء طرف من الجهة العسكرية موضح عدد سنوات الخدمة';
            break;
        case "15":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'قرار من اللجنة الطبية العسكرية';
            break;
        case "16":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات عدم زواج الاخوات اثبات عدم وجود رب للاسره';
            break;
        case "17":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'إذا كانت ارملة او مطلقةبائناً او كان زوجها عاجز عن الكسب';
            break;
        case "18":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'بشرط يكون الاب عاجزاً صحياً او عاجزاً عن الكسب';
            break;
        case "19":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات عدم زواج الاخوات اثبات عدم وجود عائل للاسره';
            break;
        case "20":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات من الجهة المختصة بأسر الاب + اثبات عدم عمل الاخوه';
            break;
        case "21":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات من المحكمة بفقدان الاب + اثبات عدم عمل الاخوه';
            break;
        case "22" || "23" || "24" || "25":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'كتاب من الجوازات موضح فية عدد افراد الاسره';
            break;
        case "26":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اذا كان لدية اخ مقعد غير قادر على خدمة نفسه';
            break;
        case "27":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهادة وفاه الزوحة + كتاب من الجوازات موضح فية عدد افراد الاسره';
            break;
        case "28" || "29":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات من المحكمة';
            break;
        case "30":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'كتاب من مركز معلومات الطلبة / ن لا يزيد21 سنة';
            break;
        case "31":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'قبول غير مشروط / ن لا يزيد28 سنة';
            break;
        case "32":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'قبول غير مشروط';
            break;
        case "33":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'قبول طب غير مشروط';
            break;
        case "34":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'شهاده قيد من الجامعة + كشف درجات ';
            break;
        case "35":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات بالدراسة قبل سريان احكام القانون ان لا يزيد 25 سنة ';
            break;
        case "36":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات بالدراسة قبل سريان احكام القانون ان لا يزيد 28 سنة ';
            break;
        case "37":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات من التعليم او الجامعة';
            break;
        case "38" || "40":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات من وزارة العمل';
            break;
        case "39" || "42":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات من وزارة التعليم والتعليم العالى';
            break;
        case "41" || "43" || "44":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'اثبات من وزارة الصحة';
            break;
        case "45":
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'مرفقات اخرى';
            $('#Notes_Other').attr('disabled', false);
            break;
        default:
            document.getElementById("lblphotos_University_Delay_Exemption_Exception").innerHTML = 'لايوجد مرفق';
            break;
    }
}



var changeChkDelay_Exemption_Exception = function ($this) {
    changeDelay_Exemption_Exception($($this).is(":checked"));

}


function changeDelay_Exemption_Exception(value) {

    var panelbar_Postponement_exemption = $("#panelbar_Postponement_exemption").data("kendoPanelBar");
    if (value) {

        panelbar_Postponement_exemption.expand($("#Postponement_exemptionPanel"));
        $('#lblPostponement_Exemption_Requirements').addClass('required-label')
        $('#divPostponement_Exemption_Requirements').addClass('is-required')



    }
    else {

        panelbar_Postponement_exemption.collapse($("#Postponement_exemptionPanel"));
        $('#lblPostponement_Exemption_Requirements').removeClass('required-label')
        $('#divPostponement_Exemption_Requirements').removeClass('is-required')


    }
}

function changeJobs(value) {

    var panelBar = $("#panelbar_InfoWrokCurrent").data("kendoPanelBar");
    // expand the element with ID, "item1"

    if (value == 1) {


        panelBar.expand($("#InfoWrokCurrentPanel"));

        $('#lblEmployer').addClass('required-label')
        $('#divEmployer').addClass('is-required')


        $('#lblMinistry').addClass('required-label')
        $('#divMinistry').addClass('is-required')


        $('#lblTypeWork').addClass('required-label')
        $('#divTypeWork').addClass('is-required')

        $('#lblPhoneWork').addClass('required-label')
        $('#divPhoneWork').addClass('is-required')

        $('#lblAddressWork').addClass('required-label')
        $('#divAddressWork').addClass('is-required')

    }
    else {

        panelBar.collapse($("#InfoWrokCurrentPanel"));

        $('#lblEmployer').removeClass('required-label')
        $('#divEmployer').removeClass('is-required')


        $('#lblMinistry').removeClass('required-label')
        $('#divMinistry').removeClass('is-required')


        $('#lblTypeWork').removeClass('required-label')
        $('#divTypeWork').removeClass('is-required')

        $('#lblPhoneWork').removeClass('required-label')
        $('#divPhoneWork').removeClass('is-required')

        $('#lblAddressWork').removeClass('required-label')
        $('#divAddressWork').removeClass('is-required')
    }
}

function dropdownlist_changeJobs(e) {
    var value = this.value();
    changeJobs(value)


}


function dropdownlist_change(e) {
    var value = this.value();
    // Use the value of the widget
    FillLabel_lblphotos_University_Delay_Exemption_Exception(value);

}
function api_call() {

    var token = sessionStorage['token'];
    var InsertedBy = sessionStorage['UserId'];

    var Lang = sessionStorage['lang'];
    var URL = $URL_University + "GetUniversityById?InsertedBy=" + InsertedBy + "&&Lang=" + Lang;
    $.ajax({
        type: 'Get',
        url: URL,
        headers: {
            Authorization: 'bearer ' + token
        },
        async: false,
        data: { Lang: Lang },
        success: function (data, status, xhr) {


            if (data.success === true) {
                successCallBack(data);
            }
            else {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultMessage').removeClass('hide');
                $('#ResultTxt').html(data.message);
                setTimeout("$('#ResultMessage').removeClass('show')", 5000);

            }
        }
    }).fail(function (xhr, status) {
        if (status === "error") {
            return "Sorry but there was an error: " + xhr.status + " " + xhr.statusText;
        }
    });
}

function Download(url) {
    document.getElementById('my_iframe').src = url;
};


function api_callAddmin(data) {





    $('#ApprovedBy').val(data.datalist.approvedBy);
    $('#ModifiedBy').val(data.datalist.modifiedBy);
    $('#InsertedBy').val(data.datalist.insertedBy);
    $('#ApprovedDate').val(data.datalist.approvedDate);
    $('#CreateDate').val(data.datalist.createDate);
    $('#LastModifyDate').val(data.datalist.lastModifyDate);



    $("#panelbar_Postponement_exemption").kendoPanelBar({
        expandMode: "multiple"
    });

    $("#panelbar_InfoWrokCurrent").kendoPanelBar({
        expandMode: "multiple"
    });


    var panelBar = $("#panelbar_InfoWrokCurrent").data("kendoPanelBar");
    // expand the element with ID, "item1"
    panelBar.expand($("#InfoWrokCurrentPanel"));

    $(':input, select ', '#UniversityForm').attr('disabled', true);
    DisabledEnableKendoDropDownByForm('UniversityForm', false)

    $('#UpdateCompany').attr('disabled', false);



    $('#photos_Passport').parent().hide();
    $('#delete-image-Passport').hide();

    $('#photos_QID').parent().hide();
    $('#delete-image-QID').hide();

    $('#photos_person').parent().hide();
    $('#delete-image-person').hide();

    $('#photos_Certificates').parent().hide();
    $('#delete-image-Certificates').hide();

    $('#photos_workletter_MinistryDevelopment').parent().hide();
    $('#delete-image-workletter_MinistryDevelopment').hide();

    $('#photos_married').parent().hide();
    $('#delete-image-married').hide();

    $('#photos_Health').parent().hide();
    $('#delete-image-Health').hide();


    $('#photos_Transcript').parent().hide();
    $('#delete-image-Transcript').hide();

    $('#photos_other').parent().hide();
    $('#delete-image-other').hide();


    $('#UniversityForm').attr('disabled', false);


    fillDropdown('ManagementAction', data_ManagementAction, data.datalist.managementAction, false)
    fillDropdown('UniversitySocialStatus', data_UniversitySocialStatus, data.datalist.universitySocialStatus, false)
    fillDropdown('IsEmployee', data_Jobs, data.datalist.isEmployee, false)
    fillDropdown('Ministry', data_Ministry, data.datalist.ministry, false)
    fillDropdown('UniversitySpecialization', data_UniversitySpecialization, data.datalist.universitySpecialization, false)
    fillDropdown('UniversityLocation', data_county, data.datalist.universityLocation, false)
    fillDropdown('UniversityBloodType', data_UniversityBloodType, data.datalist.universityBloodType, false)
    fillDropdown('University_Delay_Exemption_Exception', data_Reasons_Postponement_Exemption_Requirements, data.datalist.university_Delay_Exemption_Exception, false)
    changeJobs(data.datalist.isEmployee)


    if (data.datalist.university_Delay_Exemption_Exception == '45') {
        $('#Notes_Other').attr('disabled', false);
    }

    var dropdownlist_ManagementAction = $("#ManagementAction").data("kendoDropDownList");
    dropdownlist_ManagementAction.enable(true);

    $('#Management_Notes').attr('disabled', false);


    if (data.datalist.isAddDelay_Exemption_Exception == true) {

        $('#ChkDelay_Exemption_Exception').prop("checked", true);
    } else {
        $('#ChkDelay_Exemption_Exception').prop("checked", false);
    }



    changeDelay_Exemption_Exception(data.datalist.isAddDelay_Exemption_Exception)

    $('#ManagementAction').val(data.datalist.managementAction);
    $('#Management_Notes').val(data.datalist.management_Notes);


    $('#Notes_Other').val(data.datalist.notes_Other);
    $('#UniversityId').val(data.datalist.universityId);
    $('#UniversityName1').val(data.datalist.universityName1);
    $('#UniversityName2').val(data.datalist.universityName2);
    $('#UniversityName3').val(data.datalist.universityName3);
    $('#UniversityName4').val(data.datalist.universityName4);
    $('#UniversityNameEN').val(data.datalist.universityNameEN);
    $('#UniversityQID').val(data.datalist.universityQID);

    $('#UniversityCertificateDegree').val(data.datalist.universityCertificateDegree);
    $('#UniversityCertificateDegreeDate').val(data.datalist.universityCertificateDegreeDate);
/*    $('#UniversitySpecialization').val(data.datalist.universitySpecialization);*/
 /*   $('#UniversityLocation').val(data.datalist.universityLocation);*/
    $('#UniversityAverage').val(data.datalist.universityAverage);





    $('#UniversityMobile1').val(data.datalist.universityMobile1);
    $('#UniversityMobile2').val(data.datalist.universityMobile2);
    $('#UniversityPhoneHome').val(data.datalist.universityPhoneHome);
    $('#UniversityFax').val(data.datalist.universityFax);
    $('#UniversityMobileFriend').val(data.datalist.universityMobileFriend);
    $("#UniversityBrithDayDate").kendoDatePicker({ value: data.datalist.universityBrithDayDate });

    var ddlMinistry = $("#Ministry").data("kendoDropDownList");
    ddlMinistry.value(data.datalist.ministry);

    var ddlIsEmployee = $("#IsEmployee").data("kendoDropDownList");
    ddlIsEmployee.value(data.datalist.isEmployee);

    $('#Notes_Other').val(data.datalist.notes_Other);
    $('#UniversityEmployer').val(data.datalist.universityEmployer);
    $('#UniversityTypeWork').val(data.datalist.universityTypeWork);
    $('#UniversityPhoneWork').val(data.datalist.universityPhoneWork);
    $('#UniversityFaxWork').val(data.datalist.universityFaxWork);
    $('#UniversityAddressWork').val(data.datalist.universityAddressWork);
    $('#UniversityZone').val(data.datalist.universityZone);
    $('#UniversityStreetName').val(data.datalist.universityStreetName);
    $('#SoliderHomeNo').val(data.datalist.soliderHomeNo);


    FillLabel_lblphotos_University_Delay_Exemption_Exception(JSON.stringify(data.datalist.university_Delay_Exemption_Exception));




    var img_url_Passport = data.img_url_Passport;
    var imageName_Passport = data.datalist.imageName_Passport;
    if (img_url_Passport !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Passport").attr("src", img_url_Passport);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Passport').val(imageName_Passport);
    }






    var img_url_person = data.img_url_person;
    var imageName_person = data.datalist.imageName_person;
    if (img_url_person !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_person").attr("src", img_url_person);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_person').val(imageName_person);
    }


    var img_url_QID = data.img_url_QID;
    var imageName_QID = data.datalist.imageName_QID;
    if (img_url_QID !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_QID").attr("src", img_url_QID);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_QID').val(imageName_QID);
    }


    var img_url_Certificates = data.img_url_Certificates;
    var imageName_Certificates = data.datalist.imageName_Certificates;
    if (img_url_Certificates !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Certificates").attr("src", img_url_Certificates);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Certificates').val(imageName_Certificates);
    }


    var img_url_workletter_MinistryDevelopment = data.img_url_workletter_MinistryDevelopment;
    var imageName_workletter_MinistryDevelopment = data.datalist.imageName_workletter_MinistryDevelopment;
    if (img_url_workletter_MinistryDevelopment !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_workletter_MinistryDevelopment").attr("src", img_url_workletter_MinistryDevelopment);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_workletter_MinistryDevelopment').val(imageName_workletter_MinistryDevelopment);
    }





    var img_url_married = data.img_url_married;
    var imageName_married = data.datalist.imageName_married;
    if (img_url_married !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_married").attr("src", img_url_married);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_married').val(imageName_married);
    }



    var img_url_Health = data.img_url_Health;
    var imageName_Health = data.datalist.imageName_Health;
    if (img_url_Health !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Health").attr("src", img_url_Health);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Health').val(imageName_Health);
    }



    var img_url_Transcript = data.img_url_Transcript;
    var imageName_Transcript = data.datalist.imageName_Transcript;
    if (img_url_Transcript !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Transcript").attr("src", img_url_Transcript);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Transcript').val(imageName_Transcript);
    }



    var img_url_other = data.img_url_other;
    var ImageName_other = data.datalist.imageName_other;
    if (img_url_other !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_other").attr("src", img_url_other);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_other').val(ImageName_other);
    }



    try {


        $('#lblPassport').attr({
            target: '_blank',
            href: img_url_Passport
        });

        $('#lblperson').attr({
            target: '_blank',
            href: img_url_person
        });
        $('#lblQID').attr({
            target: '_blank',
            href: img_url_QID
        });
        $('#lblCertificates').attr({
            target: '_blank',
            href: img_url_Certificates
        });
        $('#lblworkletter_MinistryDevelopment').attr({
            target: '_blank',
            href: img_url_workletter_MinistryDevelopment
        });
        $('#lblmarried').attr({
            target: '_blank',
            href: img_url_married
        });
        $('#lblHealth').attr({
            target: '_blank',
            href: img_url_Health
        });
        $('#lblTranscript').attr({
            target: '_blank',
            href: img_url_Transcript
        });
        $('#lbl__other').attr({
            target: '_blank',
            href: img_url_other
        });

    } catch (e) {
        alert(e)
    }

    $dataForm = $('#UniversityForm').serializeArray();

}



var FillForm = function (data) {




    var token = sessionStorage['token'];
    var InsertedBy = sessionStorage['UserId'];
    var UniversityId = data.UniversityId;


    var Lang = sessionStorage['lang'];
    var URL = $URL_University + "GetUniversityByuniversityID?UniversityId=" + UniversityId + "&&Lang=" + Lang;
    $.ajax({
        type: 'Get',
        url: URL,
        headers: {
            Authorization: 'bearer ' + token
        },
        async: false,
        data: { Lang: Lang },
        success: function (data, status, xhr) {


            if (data.success === true) {
                api_callAddmin(data);
                $dataForm = $('#' + sessionStorage['ChildlastPage']).serialize();
            }
            else {
                $('#ResultMessage').addClass('alert-danger show');
                $('#ResultMessage').removeClass('hide');
                $('#ResultTxt').html(data.message);
                setTimeout("$('#ResultMessage').removeClass('show')", 5000);

            }
        }
    }).fail(function (xhr, status) {
        if (status === "error") {
            return "Sorry but there was an error: " + xhr.status + " " + xhr.statusText;
        }
    });






}




var successCallBack = function (data) {





    $('#ApprovedBy').val(data.datalist.approvedBy);
    $('#ModifiedBy').val(data.datalist.modifiedBy);
    $('#InsertedBy').val(data.datalist.insertedBy);
    $('#ApprovedDate').val(data.datalist.approvedDate);
    $('#CreateDate').val(data.datalist.createDate);
    $('#LastModifyDate').val(data.datalist.lastModifyDate);







    changeJobs(data.datalist.isEmployee)
    if (data.datalist.isAddDelay_Exemption_Exception === true) {
        $('#ChkDelay_Exemption_Exception').prop("checked", true);
    }
    else {
        $('#ChkDelay_Exemption_Exception').prop("checked", false);
    }
    changeDelay_Exemption_Exception(data.datalist.isAddDelay_Exemption_Exception)




    $('#UniversityId').val(data.datalist.universityId);
    $('#UniversityName1').val(data.datalist.universityName1);
    $('#UniversityName2').val(data.datalist.universityName2);
    $('#UniversityName3').val(data.datalist.universityName3);
    $('#UniversityName4').val(data.datalist.universityName4);
    $('#UniversityNameEN').val(data.datalist.universityNameEN);
    $('#UniversityQID').val(data.datalist.universityQID);

    $('#UniversityCertificateDegree').val(data.datalist.universityCertificateDegree);
    $('#UniversityCertificateDegreeDate').val(data.datalist.universityCertificateDegreeDate);
  /*  $('#UniversitySpecialization').val(data.datalist.universitySpecialization);*/
  /*  $('#UniversityLocation').val(data.datalist.universityLocation);*/
    $('#UniversityAverage').val(data.datalist.universityAverage);





    $('#UniversityMobile1').val(data.datalist.universityMobile1);
    $('#UniversityMobile2').val(data.datalist.universityMobile2);
    $('#UniversityPhoneHome').val(data.datalist.universityPhoneHome);
    $('#UniversityFax').val(data.datalist.universityFax);
    $('#UniversityMobileFriend').val(data.datalist.universityMobileFriend);

    $("#UniversityBrithDayDate").kendoDatePicker({ value: data.datalist.universityBrithDayDate });

    var dropdownlist = $("#UniversitySocialStatus").data("kendoDropDownList");
    dropdownlist.value(data.datalist.universitySocialStatus);

    var ddlUniversityBloodType = $("#UniversityBloodType").data("kendoDropDownList");
    ddlUniversityBloodType.value(data.datalist.universityBloodType);


    var ddlMinistry = $("#Ministry").data("kendoDropDownList");
    ddlMinistry.value(data.datalist.ministry);



    var ddlUniversitySpecialization = $("#UniversitySpecialization").data("kendoDropDownList");
    ddlUniversitySpecialization.value(data.datalist.universitySpecialization);

  
    var ddluniversityLocation = $("#UniversityLocation").data("kendoDropDownList");
    ddluniversityLocation.value(data.datalist.universityLocation);





    var ddlIsEmployee = $("#IsEmployee").data("kendoDropDownList");
    ddlIsEmployee.value(data.datalist.isEmployee);

    $('#Notes_Other').val(data.datalist.notes_Other);
    $('#UniversityEmployer').val(data.datalist.universityEmployer);
    $('#UniversityTypeWork').val(data.datalist.universityTypeWork);
    $('#UniversityPhoneWork').val(data.datalist.universityPhoneWork);
    $('#UniversityFaxWork').val(data.datalist.universityFaxWork);
    $('#UniversityAddressWork').val(data.datalist.universityAddressWork);
    $('#UniversityZone').val(data.datalist.universityZone);
    $('#UniversityStreetName').val(data.datalist.universityStreetName);
    $('#SoliderHomeNo').val(data.datalist.soliderHomeNo);



    var ddlUniversity_Delay_Exemption_Exception = $("#University_Delay_Exemption_Exception").data("kendoDropDownList");
    ddlUniversity_Delay_Exemption_Exception.value(data.datalist.university_Delay_Exemption_Exception);


    FillLabel_lblphotos_University_Delay_Exemption_Exception(JSON.stringify(data.datalist.university_Delay_Exemption_Exception));
    //InsertedBy
    //CreateDate
    //LastModifyDate
    //ModifiedBy
    //ImageName
    //ApprovedBy
    //ApprovedDate
    //StatusID



    //$('#ApprovedBy').val(data.datalist.approvedBy);
    //$('#ApprovedDate').val(data.datalist.approvedDate);
    //alert(JSON.stringify(data.datalist))
    //$('#StatusId').val(data.datalist.statusId);
    //$('#CreationDate').val(data.datalist.creationDate);




    //fillDropdown('City', sessionStorage['City'], data.datalist.cityId, true);
    //fillDropdown('Currency', list_Currency, data.datalist.currencyId, true);


    var img_url_Passport = data.img_url_Passport;
    var imageName_Passport = data.datalist.imageName_Passport;
    if (img_url_Passport !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Passport").attr("src", img_url_Passport);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Passport').val(imageName_Passport);
    }


    var img_url_person = data.img_url_person;
    var imageName_person = data.datalist.imageName_person;
    if (img_url_person !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_person").attr("src", img_url_person);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_person').val(imageName_person);
    }


    var img_url_QID = data.img_url_QID;
    var imageName_QID = data.datalist.imageName_QID;
    if (img_url_QID !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_QID").attr("src", img_url_QID);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_QID').val(imageName_QID);
    }


    var img_url_Certificates = data.img_url_Certificates;
    var imageName_Certificates = data.datalist.imageName_Certificates;
    if (img_url_Certificates !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Certificates").attr("src", img_url_Certificates);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Certificates').val(imageName_Certificates);
    }


    var img_url_workletter_MinistryDevelopment = data.img_url_workletter_MinistryDevelopment;
    var imageName_workletter_MinistryDevelopment = data.datalist.imageName_workletter_MinistryDevelopment;
    if (img_url_workletter_MinistryDevelopment !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_workletter_MinistryDevelopment").attr("src", img_url_workletter_MinistryDevelopment);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_workletter_MinistryDevelopment').val(imageName_workletter_MinistryDevelopment);
    }





    var img_url_married = data.img_url_married;
    var imageName_married = data.datalist.imageName_married;
    if (img_url_married !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_married").attr("src", img_url_married);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_married').val(imageName_married);
    }



    var img_url_Health = data.img_url_Health;
    var imageName_Health = data.datalist.imageName_Health;
    if (img_url_Health !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Health").attr("src", img_url_Health);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Health').val(imageName_Health);
    }


    var img_url_Transcript = data.img_url_Transcript;
    var imageName_Transcript = data.datalist.imageName_Transcript;
    if (img_url_Transcript !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_Transcript").attr("src", img_url_Transcript);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_Transcript').val(imageName_Transcript);
    }



    var img_url_other = data.img_url_other;
    var ImageName_other = data.datalist.imageName_other;
    if (img_url_other !== '') {
        /*var img_url = data.datalist.imageName;*/
        $("#preview_other").attr("src", img_url_other);
        /*   var ImageName = img_url.substring(img_url.lastIndexOf('/') + 1);*/
        $('#ImageName_other').val(ImageName_other);
    }


    $dataForm = $('#UniversityForm').serializeArray();
}

var ImageChange = function (input) {

    var reader;
    if (input.files && input.files[0]) {

        reader = new FileReader();
        reader.onload = function (e) {
            $('#preview').attr('src', e.target.result);
            $('#lblImage').html(input.files[0].name)
        }
        reader.readAsDataURL(input.files[0]);
    }
}

function validFrm() {
    if ($('.error-message').length === 0)
        return true;
    else
        return false;
}





var SaveUniversity = function (next) {

    //if (!validFrm()) {
    //    return false;
    //}


    jconfirmSave(DBSTRING['MadeChangeFormNotSave'], DBSTRING['Save'], function (r) {
        if (r === 1) { //Ok
            if (!ValidateForm('UniversityForm'))
                return false;




            var obj = {
                "UniversityId": "", "UniversityName1": "", "UniversityName2": "", "UniversityName3": "", "UniversityName4": "", "UniversityNameEN": "",
                "UniversityQID": "", "UniversityCertificateDegree": "", "UniversityCertificateDegreeDate": "", "UniversityMobile1": "", "UniversityMobile2": "",
                "UniversityPhoneHome": "", "UniversityFax": "", "UniversityMobileFriend": "", "UniversityBrithDayDate": "", "UniversitySocialStatus": "",
                "UniversityBloodType": "", "UniversityEmployer": "", "UniversityTypeWork": "", "UniversityPhoneWork": "",
                "UniversityFaxWork": "", "UniversityAddressWork": "", "UniversityZone": "", "UniversityStreetName": "", "SoliderHomeNo": "",
                "ModifiedBy": "", "InsertedBy": "", "LastModifyDate": "", "ApprovedBy": "", "ApprovedDate": "",
                "StatusId": "", "CreateDate": "",
                "ImageName_Passport": "", "ImageName_workletter_MinistryDevelopment": "", "ImageName_Certificates": "", "ImageName_person": "", "ImageName_QID": "", "ImageName_other": "",
                "ImageName_Health": "", "ImageName_married": "", "UniversitySpecialization": "", "UniversityLocation": "", "UniversityAverage": "",
                "University_Delay_Exemption_Exception": "", "IsEmployee": "", "IsAddDelay_Exemption_Exception": "", "ManagementAction": "", "Management_Notes": "", "Ministry": "", "Notes_Other": ""
                , "ImageName_Transcript": "",
            };



            obj.Notes_Other = $('#Notes_Other').val();
            obj.Ministry = $('#Ministry').val();
            obj.IsEmployee = $('#IsEmployee').val();
            obj.IsAddDelay_Exemption_Exception = $('#IsAddDelay_Exemption_Exception').is(':checked');



            obj.ImageName_Passport = $('#ImageName_Passport').val();
            obj.ImageName_workletter_MinistryDevelopment = $('#ImageName_workletter_MinistryDevelopment').val();
            obj.ImageName_Certificates = $('#ImageName_Certificates').val();
            obj.ImageName_person = $('#ImageName_person').val();
            obj.ImageName_QID = $('#ImageName_QID').val();
            obj.ImageName_Health = $('#ImageName_Health').val();
            obj.ImageName_Transcript = $('#ImageName_Transcript').val();
            obj.ImageName_married = $('#ImageName_married').val();
            obj.ImageName_other = $('#ImageName_other').val();

            obj.UniversityName1 = $('#UniversityName1').val();
            obj.UniversityName2 = $('#UniversityName2').val();
            obj.UniversityName3 = $('#UniversityName3').val();
            obj.UniversityName4 = $('#UniversityName4').val();
            obj.UniversityNameEN = $('#UniversityNameEN').val();
            obj.UniversityQID = $('#UniversityQID').val();
            obj.UniversityBrithDayDate = $('#UniversityBrithDayDate').val();
            obj.UniversitySocialStatus = $('#UniversitySocialStatus').val();
            obj.UniversityBloodType = $('#UniversityBloodType').val();


            obj.UniversityCertificateDegree = $('#UniversityCertificateDegree').val();
            obj.UniversityCertificateDegreeDate = $('#UniversityCertificateDegreeDate').val();
            obj.UniversitySpecialization = $('#UniversitySpecialization').val();
            obj.UniversityLocation = $('#UniversityLocation').val();
            obj.UniversityAverage = $('#UniversityAverage').val();


            obj.UniversityMobile1 = $('#UniversityMobile1').val();
            obj.UniversityMobile2 = $('#UniversityMobile2').val();
            obj.UniversityPhoneHome = $('#UniversityPhoneHome').val();
            obj.UniversityFax = $('#UniversityFax').val();
            obj.UniversityMobileFriend = $('#UniversityMobileFriend').val();



            obj.UniversityEmployer = $('#UniversityEmployer').val();
            obj.UniversityTypeWork = $('#UniversityTypeWork').val();
            obj.UniversityPhoneWork = $('#UniversityPhoneWork').val();
            obj.UniversityFaxWork = $('#UniversityFaxWork').val();
            obj.UniversityAddressWork = $('#UniversityAddressWork').val();


            obj.UniversityZone = $('#UniversityZone').val();
            obj.UniversityStreetName = $('#UniversityStreetName').val();
            obj.SoliderHomeNo = $('#SoliderHomeNo').val();




            obj.University_Delay_Exemption_Exception = $('#University_Delay_Exemption_Exception').val();


            obj.ApprovedBy = $('#ApprovedBy').val();
            obj.ModifiedBy = $('#ModifiedBy').val();
            obj.InsertedBy = $('#InsertedBy').val();
            obj.ApprovedDate = $('#ApprovedDate').val();
            obj.CreateDate = $('#CreateDate').val();
            obj.LastModifyDate = $('#LastModifyDate').val();






            var Lang = sessionStorage['lang'];
            var token = sessionStorage['token'];


            if (sessionStorage['IsSuperAdmin'] == 'true') {
                obj.ManagementAction = $('#ManagementAction').val();
                obj.Management_Notes = $('#Management_Notes').val();


                if ($('#ManagementAction').val() == 4) {
                    obj.ApprovedBy = sessionStorage['UserId'];
                }


                obj.StatusId = $('#ManagementAction').val();
                obj.UniversityId = $('#UniversityId').val();
                var URL = $URL_University + "SaveUniversity?Lang=" + Lang;

            }
            else {
                if ($('#UniversityId').val() != null && $('#UniversityId').val() != '') {
                    obj.UniversityId = $('#UniversityId').val();
                    obj.ModifiedBy = sessionStorage['UserId'];
                    obj.StatusId = 5;




                    var URL = $URL_University + "UpdateUniversity?Lang=" + Lang;
                } else {
                    obj.StatusId = 1;
                    obj.UniversityId = 0;
                    obj.InsertedBy = sessionStorage['UserId'];
                    var URL = $URL_University + "AddUniversity?Lang=" + Lang;
                }
            }



            $.ajax({
                type: "POST",
                url: URL,
                dataType: "Json",
                contentType: 'application/json',
                async: false,
                cache: false,
                headers: {
                    Authorization: 'bearer ' + token
                },
                data: JSON.stringify(obj),
                success: function (data) {

                    if (sessionStorage['IsSuperAdmin'] == 'true') {
                        if (data.success === true) {
                            try {



                                $("#grid").data("kendoGrid").dataSource.read();


                                $('#ResultMessage').addClass('alert-success show');
                                $('#ResultTxt').html(data.message);
                                setTimeout("$('#ResultMessage').removeClass('show')", 5000);
                                callback(true);
                            }
                            catch (ex) { }
                            if (IsComeFromDestroy) {
                                $dataForm = '';
                                $('#ChildContent').hide();
                                $('#MainContent').show();
                            }


                        }
                        else {
                            $('#ResultMessage').addClass('alert-success show');
                            $('#ResultTxt').html(data.message);

                            setTimeout("$('#ResultMessage').removeClass('show')", 2000);

                            if ($('#UniversityId').val() === '') {
                                $(':input', '#UniversityForm')
                                    .not(':button, :submit, :reset, :hidden')
                                    .val('')
                                    .prop('checked', false)
                                    .prop('selected', false);
                            }
                            $dataForm = $('#' + sessionStorage['ChildlastPage']).serialize();
                        }

                    } else {
                        if (data.success === true) {



                            current_fs = $(next).parent();
                            next_fs = $(next).parent().next();


                            //Add Class Active
                            $("#progressbar li").eq($("fieldset").index(next_fs)).addClass("active");

                            //show the next fieldset
                            next_fs.show();
                            //hide the current fieldset with style
                            current_fs.animate({ opacity: 0 }, {
                                step: function (now) {
                                    // for making fielset appear animation
                                    opacity = 1 - now;

                                    current_fs.css({
                                        'display': 'none',
                                        'position': 'relative'
                                    });
                                    next_fs.css({ 'opacity': opacity });
                                },
                                duration: 300
                            });

                            try {
                                setProgressBar(++current);
                            } catch (e) {
                                alert(e)
                            }



                            //$('#ResultMessage').addClass('alert-success show');
                            //$('#ResultTxt').html(data.message);
                        }
                        else {

                            $('#ResultMessage').addClass('alert-danger show');
                            $('#ResultMessage').removeClass('hide');
                            $('#ResultTxt').html(data.message);
                        }

                        setTimeout("$('#ResultMessage').removeClass('show')", 5000);
                        callback(true);

                    }




                },
                error: function (jqXHR, exception) {
                    var msg = '';
                    if (jqXHR.status === 0) {
                        msg = 'Not connect.\n Verify Network.';
                    } else if (jqXHR.status === 404) {
                        msg = 'Requested page not found. [404]';
                    } else if (jqXHR.status === 500) {
                        msg = 'Internal Server Error [500].';
                    } else if (exception === 'parsererror') {
                        msg = 'Requested JSON parse failed.';
                    } else if (exception === 'timeout') {
                        msg = 'Time out error.';
                    } else if (exception === 'abort') {
                        msg = 'Ajax request aborted.';
                    } else {
                        msg = 'Uncaught Error.\n' + jqXHR.responseText;
                    }
                    alert(msg);
                }
            });

        }
        else if (r === 0) { //No
            $dataForm = ''
            callback(false);
        }
        else { //r===2   cancel
            callback(false);
        }
    });



}